[
  {
    "slug": "/keyboard-interaction/focus-order",
    "title": "Is focus order predictable, logical, and intuitive?",
    "description": "",
    "content": "### What this means\n\nWhen someone uses the keyboard to move through a page, typically by pressing the `Tab` key, the order in which interactive elements receive focus should make sense. Focus should follow the visual reading flow of the page. That usually means left to right and top to bottom.\n\nIf the focus order jumps around unexpectedly or skips important elements, it makes the interface harder to use and understand.\n\n**ONLY** interactive elements should receive focus. Elements such as buttons, links, and form fields. Regular text should be skipped as it is not interactive.\n\n### Why this matters\n\nKeyboard users do not experience the whole interface at once. They move through the interface one element at a time. If the focus order is unpredictable, users can get lost or miss key actions. That can result in a frustrating experience.\n\nFor screen readers users, the focus order is also how content is announced. A logical, intuitive flow improves usability for these users.\n\n### What this looks like\n\n<div className={'diagram-container flex-col lg:flex-row'}>\n  <figure className={'w-full lg:w-1/2'}>\n    <img src={'/images/examples/keyboard-interaction/focus-order-1.webp'} alt=\"Good tab order\" />\n\n    <figcaption>Good Tab Order</figcaption>\n  </figure>\n\n  <figure className={\"w-full lg:w-1/2\"}>\n    <img src={'/images/examples/keyboard-interaction/focus-order-2.webp'} alt=\"Bad tab order\" />\n\n    <figcaption>Bad Tab Order</figcaption>\n  </figure>\n</div>\n\n### What this feels like\n\n* **[Example 1](/examples/keyboard-interaction/focus-order/1)** - Good tab order\n* **[Example 2](/examples/keyboard-interaction/focus-order/2)** - Bad tab order\n* **[Example 3](/examples/keyboard-interaction/focus-order/3)** - Good dialog tab order\n* **[Example 4](/examples/keyboard-interaction/focus-order/4)** - Bad dialog tab order\n\n### What to check for\n\n* Does focus move from left to right and top to bottom in a way that matches the visual layout? (In right-to-left languages, this is reversed.)\n* Are key elements, like buttons and form fields, included in the focus order?\n* Do modals and overlays move focus into the new content when opened?\n* When those elements close, does the focus return to the element that opened it?\n\n### What to avoid\n\n* Non-interactive elements in the focus order.\n* Elements that unexpectedly receive focus, such as hidden or offscreen items.\n* Focus moving around in unexpected directions.\n\n### Related Standards\n\n* **[WCAG 2.2 – 2.4.3](https://www.w3.org/WAI/WCAG22/Understanding/focus-order.html)** - Focus Order\n* **[WCAG 2.2 – 2.1.1](https://www.w3.org/WAI/WCAG22/Understanding/keyboard)** - Keyboard\n* **EN 301 549 - 9.2.4.3** - Focus Order\n* **EN 301 549 - 9.1.3.2** Meaningful Sequence\n",
    "_searchMeta": {
      "cleanContent": "what this means when someone uses the keyboard to move through a page typically by pressing the tab key the order in which interactive elements receive focus should make sense focus should follow the visual reading flow of the page that usually means left to right and top to bottom if the focus order jumps around unexpectedly or skips important elements it makes the interface harder to use and understand only interactive elements should receive focus elements such as buttons links and form fields regular text should be skipped as it is not interactive why this matters keyboard users do not experience the whole interface at once they move through the interface one element at a time if the focus order is unpredictable users can get lost or miss key actions that can result in a frustrating experience for screen readers users the focus order is also how content is announced a logical intuitive flow improves usability for these users what this looks like div classname diagram-container flex-col lg:flex-row figure classname w-full lg:w-1 2 img src images examples keyboard-interaction focus-order-1 webp alt good tab order figcaption good tab order figcaption figure figure classname w-full lg:w-1 2 img src images examples keyboard-interaction focus-order-2 webp alt bad tab order figcaption bad tab order figcaption figure div what this feels like example 1 - good tab order example 2 - bad tab order example 3 - good dialog tab order example 4 - bad dialog tab order what to check for does focus move from left to right and top to bottom in a way that matches the visual layout in right-to-left languages this is reversed are key elements like buttons and form fields included in the focus order do modals and overlays move focus into the new content when opened when those elements close does the focus return to the element that opened it what to avoid non-interactive elements in the focus order elements that unexpectedly receive focus such as hidden or offscreen items focus moving around in unexpected directions related standards wcag 2 2 2 4 3 - focus order wcag 2 2 2 1 1 - keyboard en 301 549 - 9 2 4 3 - focus order en 301 549 - 9 1 3 2 meaningful sequence",
      "headings": [],
      "keywords": [
        "keyboard interaction",
        "focus order",
        "tabbing",
        "ONLY",
        "[Example 1](/examples/keyboard-interaction/focus-order/1)",
        "[Example 2](/examples/keyboard-interaction/focus-order/2)",
        "[Example 3](/examples/keyboard-interaction/focus-order/3)",
        "[Example 4](/examples/keyboard-interaction/focus-order/4)",
        "[WCAG 2.2 – 2.4.3](https://www.w3.org/WAI/WCAG22/Understanding/focus-order.html)",
        "[WCAG 2.2 – 2.1.1](https://www.w3.org/WAI/WCAG22/Understanding/keyboard)",
        "EN 301 549 - 9.2.4.3",
        "EN 301 549 - 9.1.3.2",
        "Tab"
      ]
    }
  },
  {
    "slug": "/keyboard-interaction/hover-and-focus",
    "title": "Are buttons, links, and other CTAs designed and implemented to consider both hover and focus states?",
    "description": "",
    "content": "## What this means\n\nInteractive elements such as buttons, links, and calls to action must provide clear visual feedback for both mouse hover and keyboard focus states. Hover states support mouse and pointer users, while focus states support keyboard and assistive technology users.\n\nHover and focus are not the same interaction and should not be treated as interchangeable. Focus states must appear when an element receives keyboard focus, regardless of whether a mouse is present. Relying on hover styles alone is not sufficient.\n\n## Why this matters\n\nKeyboard users rely on focus styles to understand which element is currently active. If interactive elements only change appearance on hover, keyboard users may have no visual indication of where they are on the page.\n\nWhen hover and focus states are inconsistent or missing, users can become disoriented, make mistakes, or be unable to complete tasks. This disproportionately affects keyboard-only users, screen reader users who rely on visual focus cues, and users with low vision.\n\nProviding clear and equivalent hover and focus feedback ensures that all users receive the same interaction cues, regardless of input method.\n\n## What to check for\n\n* Do all interactive elements display a visible focus style when navigated to using the keyboard?\n* Are hover styles for buttons, links, and CTAs also applied, or thoughtfully adapted, to focus states?\n* Is the focus style clearly visible and distinct from the default state, not just a subtle color change?\n* Does focus remain visible even when hover styles are present or when the mouse moves away?\n\n## What to avoid\n\n* Designing interaction feedback that appears only on hover and not on focus.\n* Removing native focus styles without providing a clear and accessible replacement.\n* Using focus styles that are too subtle to notice or that rely solely on color changes with low contrast.\n* Treating hover and focus as the same state in design or code without verifying keyboard behavior.\n\n## Related standards\n\n* WCAG 2.1 Success Criterion 2.4.7 Focus Visible\n* WCAG 2.1 Success Criterion 2.1.1 Keyboard\n* EN 301 549 clause 9.2.4.7 Focus Visible\n* EN 301 549 clause 9.2.1.1 Keyboard\n",
    "_searchMeta": {
      "cleanContent": "what this means interactive elements such as buttons links and calls to action must provide clear visual feedback for both mouse hover and keyboard focus states hover states support mouse and pointer users while focus states support keyboard and assistive technology users hover and focus are not the same interaction and should not be treated as interchangeable focus states must appear when an element receives keyboard focus regardless of whether a mouse is present relying on hover styles alone is not sufficient why this matters keyboard users rely on focus styles to understand which element is currently active if interactive elements only change appearance on hover keyboard users may have no visual indication of where they are on the page when hover and focus states are inconsistent or missing users can become disoriented make mistakes or be unable to complete tasks this disproportionately affects keyboard-only users screen reader users who rely on visual focus cues and users with low vision providing clear and equivalent hover and focus feedback ensures that all users receive the same interaction cues regardless of input method what to check for do all interactive elements display a visible focus style when navigated to using the keyboard are hover styles for buttons links and ctas also applied or thoughtfully adapted to focus states is the focus style clearly visible and distinct from the default state not just a subtle color change does focus remain visible even when hover styles are present or when the mouse moves away what to avoid designing interaction feedback that appears only on hover and not on focus removing native focus styles without providing a clear and accessible replacement using focus styles that are too subtle to notice or that rely solely on color changes with low contrast treating hover and focus as the same state in design or code without verifying keyboard behavior related standards wcag 2 1 success criterion 2 4 7 focus visible wcag 2 1 success criterion 2 1 1 keyboard en 301 549 clause 9 2 4 7 focus visible en 301 549 clause 9 2 1 1 keyboard",
      "headings": [
        "What this means",
        "Why this matters",
        "What to check for",
        "What to avoid",
        "Related standards"
      ],
      "keywords": [
        "hover",
        "focus",
        "keyboard focus",
        "CTA",
        "interactive elements",
        "What this means",
        "Why this matters",
        "What to check for",
        "What to avoid",
        "Related standards"
      ]
    }
  },
  {
    "slug": "/keyboard-interaction",
    "title": "Keyboard Interaction",
    "description": "Heuristics for keyboard navigation and interaction",
    "content": "# Keyboard Interaction\n\nThis category covers heuristics that ensure users can navigate and interact with your interface using a keyboard alone, without requiring a mouse or other pointing device.\n\n## Why this matters\n\nMany users rely exclusively on keyboard navigation, including:\n\n* People with motor disabilities who cannot use a mouse\n* Blind users navigating with screen readers\n* Power users who prefer keyboard shortcuts for efficiency\n* Anyone whose pointing device has stopped working\n\nKeyboard accessibility is fundamental to an inclusive digital experience.\n\n## Heuristics in this category\n\nThis category contains 4 heuristics covering essential keyboard interaction patterns.\n",
    "_searchMeta": {
      "cleanContent": "keyboard interaction this category covers heuristics that ensure users can navigate and interact with your interface using a keyboard alone without requiring a mouse or other pointing device why this matters many users rely exclusively on keyboard navigation including: people with motor disabilities who cannot use a mouse blind users navigating with screen readers power users who prefer keyboard shortcuts for efficiency anyone whose pointing device has stopped working keyboard accessibility is fundamental to an inclusive digital experience heuristics in this category this category contains 4 heuristics covering essential keyboard interaction patterns",
      "headings": ["Why this matters", "Heuristics in this category"],
      "keywords": [
        "keyboard",
        "navigation",
        "focus",
        "accessibility",
        "keyboard shortcuts",
        "Why this matters",
        "Heuristics in this category"
      ]
    }
  },
  {
    "slug": "/keyboard-interaction/keyboard-traps",
    "title": "Are we avoiding keyboard traps?",
    "description": "",
    "content": "## What this means\n\nWhen someone navigates an interface using a keyboard, they must be able to move the focus through the entire page or into and out of every interactive component. A keyboard trap occurs when focus enters an element or region but cannot leave it using standard keyboard commands.\n\nUsers should be able to navigate freely using keys such as Tab, Shift + Tab, and Escape when appropriate. No component should capture focus in a way that prevents continued navigation.\n\nKeyboard traps often occur in custom widgets, modals, menus, embedded content, or complex controls that are not implemented correctly.\n\n## Why this matters\n\nKeyboard users rely on predictable keyboard navigation to move through an interface. If focus becomes trapped, the user may be unable to reach other content or complete their task without reloading the page or switching input methods.\n\nFor screen reader users, a keyboard trap can completely block access to the rest of the interface. This creates a critical usability failure and can make the product unusable.\n\nAvoiding keyboard traps is essential for maintaining basic operability and user control.\n\n## What to check for\n\n* Can focus move away from every interactive element using the keyboard alone?\n* Can users exit modals, dialogs, menus, and overlays using standard keyboard interactions such as Tab, Shift + Tab, or Escape?\n* When focus enters a complex component, is there a clear and reliable way to move focus out again?\n* Do embedded widgets, iframes, or third party components allow keyboard users to exit them?\n\n## What to avoid\n\n* Components that trap focus without providing a keyboard method to exit.\n* Custom controls that override native keyboard behavior without recreating it correctly.\n* Requiring mouse interaction to escape a component.\n\n## Related standards\n\n* WCAG 2.1 Success Criterion 2.1.2 No Keyboard Trap\n* WCAG 2.1 Success Criterion 2.1.1 Keyboard\n* EN 301 549 clause 9.2.1.1 Keyboard\n* EN 301 549 clause 9.2.1.2 No Keyboard Trap\n",
    "_searchMeta": {
      "cleanContent": "what this means when someone navigates an interface using a keyboard they must be able to move the focus through the entire page or into and out of every interactive component a keyboard trap occurs when focus enters an element or region but cannot leave it using standard keyboard commands users should be able to navigate freely using keys such as tab shift tab and escape when appropriate no component should capture focus in a way that prevents continued navigation keyboard traps often occur in custom widgets modals menus embedded content or complex controls that are not implemented correctly why this matters keyboard users rely on predictable keyboard navigation to move through an interface if focus becomes trapped the user may be unable to reach other content or complete their task without reloading the page or switching input methods for screen reader users a keyboard trap can completely block access to the rest of the interface this creates a critical usability failure and can make the product unusable avoiding keyboard traps is essential for maintaining basic operability and user control what to check for can focus move away from every interactive element using the keyboard alone can users exit modals dialogs menus and overlays using standard keyboard interactions such as tab shift tab or escape when focus enters a complex component is there a clear and reliable way to move focus out again do embedded widgets iframes or third party components allow keyboard users to exit them what to avoid components that trap focus without providing a keyboard method to exit custom controls that override native keyboard behavior without recreating it correctly requiring mouse interaction to escape a component related standards wcag 2 1 success criterion 2 1 2 no keyboard trap wcag 2 1 success criterion 2 1 1 keyboard en 301 549 clause 9 2 1 1 keyboard en 301 549 clause 9 2 1 2 no keyboard trap",
      "headings": [
        "What this means",
        "Why this matters",
        "What to check for",
        "What to avoid",
        "Related standards"
      ],
      "keywords": [
        "keyboard navigation",
        "keyboard trap",
        "accessibility",
        "What this means",
        "Why this matters",
        "What to check for",
        "What to avoid",
        "Related standards"
      ]
    }
  },
  {
    "slug": "/keyboard-interaction/visible-focus",
    "title": "Is the focus indicator clearly visible when active elements receive focus?",
    "description": "",
    "content": "## What this means\n\nWhen someone navigates an interface using a keyboard, there must be a clear visual indicator showing which interactive element currently has focus. This is often referred to as the focus indicator or focus outline.\n\nThe focus indicator helps users understand where they are on the page as they move between links, buttons, form fields, and other interactive elements using keys such as Tab and Shift + Tab.\n\nA visible focus indicator should be easy to see against surrounding content and should not be removed or obscured by custom styling..\n\n## Why this matters\n\nKeyboard users rely on the focus indicator to orient themselves within the interface. Without a visible indicator, users cannot tell which element will respond when they press Enter or Space.\n\nFor users with low vision, cognitive disabilities, or who are navigating quickly, a weak or missing focus indicator can make the interface confusing or unusable.\n\nA clearly visible focus indicator supports efficient navigation, reduces errors, and reinforces user control over interactions.\n\n## What to check for\n\n* Is there a visible focus indicator on all interactive elements, including links, buttons, form fields, and custom controls?\n* Does the focus indicator have sufficient contrast against the background and surrounding elements?\n* Is the focus indicator still visible when custom styles, themes, or animations are applied?\n* Does focus remain visible when navigating through complex components such as menus, dialogs, and toolbars?\n\n## What to avoid\n\n* Removing focus outlines without providing an equally visible custom alternative.\n* Focus indicators that blend into the background or are too subtle to notice.\n* Focus styles that only appear on mouse interaction but not during keyboard navigation.\n* Focus indicators that are clipped, hidden, or covered by other UI elements.\n\n## Related standards\n\n* WCAG 2.1 Success Criterion 2.4.7 Focus Visible\n* WCAG 2.1 Success Criterion 2.1.1 Keyboard\n* EN 301 549 clause 9.2.4.7 Focus Visible\n* EN 301 549 clause 9.2.4.11 Focus Appearance\n",
    "_searchMeta": {
      "cleanContent": "what this means when someone navigates an interface using a keyboard there must be a clear visual indicator showing which interactive element currently has focus this is often referred to as the focus indicator or focus outline the focus indicator helps users understand where they are on the page as they move between links buttons form fields and other interactive elements using keys such as tab and shift tab a visible focus indicator should be easy to see against surrounding content and should not be removed or obscured by custom styling why this matters keyboard users rely on the focus indicator to orient themselves within the interface without a visible indicator users cannot tell which element will respond when they press enter or space for users with low vision cognitive disabilities or who are navigating quickly a weak or missing focus indicator can make the interface confusing or unusable a clearly visible focus indicator supports efficient navigation reduces errors and reinforces user control over interactions what to check for is there a visible focus indicator on all interactive elements including links buttons form fields and custom controls does the focus indicator have sufficient contrast against the background and surrounding elements is the focus indicator still visible when custom styles themes or animations are applied does focus remain visible when navigating through complex components such as menus dialogs and toolbars what to avoid removing focus outlines without providing an equally visible custom alternative focus indicators that blend into the background or are too subtle to notice focus styles that only appear on mouse interaction but not during keyboard navigation focus indicators that are clipped hidden or covered by other ui elements related standards wcag 2 1 success criterion 2 4 7 focus visible wcag 2 1 success criterion 2 1 1 keyboard en 301 549 clause 9 2 4 7 focus visible en 301 549 clause 9 2 4 11 focus appearance",
      "headings": [
        "What this means",
        "Why this matters",
        "What to check for",
        "What to avoid",
        "Related standards"
      ],
      "keywords": [
        "focus indicator",
        "focus visible",
        "accessibility",
        "keyboard navigation",
        "What this means",
        "Why this matters",
        "What to check for",
        "What to avoid",
        "Related standards"
      ]
    }
  },
  {
    "slug": "/meaningful-content/error-text",
    "title": "Are errors described in text?",
    "description": "",
    "content": "## What this means\n\nWhen an error occurs, it must be communicated using text. Users should be able to understand what went wrong without relying on color, icons, sound, or visual position alone.\n\nError text must be programmatically available so assistive technologies can announce it. The message should clearly identify the error and relate it to the affected input or action.\n\n## Why this matters\n\nScreen reader users cannot perceive visual cues such as red outlines or icons. Without text, errors may go unnoticed or be impossible to understand.\n\nText-based error descriptions also support users with low vision, color vision deficiencies, or cognitive disabilities. Clear messages reduce frustration and help users recover efficiently.\n\n## What to check for\n\n* Errors are described using clear, readable text.\n* Error messages identify the specific problem.\n* The error text is associated with the relevant field or action.\n* Assistive technologies announce error messages when they appear.\n* Errors are not conveyed by color or icons alone.\n\n## What to avoid\n\n* Indicating errors only with color, symbols, or sound.\n* Displaying generic messages that do not explain the issue.\n* Showing error states without any accompanying text.\n* Placing error text where it is not programmatically related to the error.\n\n## Related standards\n\n* WCAG 2.2 Success Criterion 3.3.1 Error Identification\n* WCAG 2.2 Success Criterion 1.3.1 Info and Relationships\n* EN 301 549 clause 9.3.3.1 Error Identification\n* EN 301 549 clause 9.1.3.1 Info and Relationships\n",
    "_searchMeta": {
      "cleanContent": "what this means when an error occurs it must be communicated using text users should be able to understand what went wrong without relying on color icons sound or visual position alone error text must be programmatically available so assistive technologies can announce it the message should clearly identify the error and relate it to the affected input or action why this matters screen reader users cannot perceive visual cues such as red outlines or icons without text errors may go unnoticed or be impossible to understand text-based error descriptions also support users with low vision color vision deficiencies or cognitive disabilities clear messages reduce frustration and help users recover efficiently what to check for errors are described using clear readable text error messages identify the specific problem the error text is associated with the relevant field or action assistive technologies announce error messages when they appear errors are not conveyed by color or icons alone what to avoid indicating errors only with color symbols or sound displaying generic messages that do not explain the issue showing error states without any accompanying text placing error text where it is not programmatically related to the error related standards wcag 2 2 success criterion 3 3 1 error identification wcag 2 2 success criterion 1 3 1 info and relationships en 301 549 clause 9 3 3 1 error identification en 301 549 clause 9 1 3 1 info and relationships",
      "headings": [
        "What this means",
        "Why this matters",
        "What to check for",
        "What to avoid",
        "Related standards"
      ],
      "keywords": [
        "error messages",
        "text alternatives",
        "forms",
        "What this means",
        "Why this matters",
        "What to check for",
        "What to avoid",
        "Related standards"
      ]
    }
  },
  {
    "slug": "/meaningful-content/form-label-visibility",
    "title": "Are form labels visible and persistent?",
    "description": "",
    "content": "## What this means\n\nForm labels must be visible and remain present at all times. Users should be able to identify the purpose of each field before, during, and after interaction.\n\nLabels should not disappear when a field receives focus or when input is entered. The label must remain available to support understanding and review.\n\n## Why this matters\n\nScreen reader users rely on labels to understand form fields consistently. If labels are hidden or removed, users may lose context when navigating or revisiting fields.\n\nVisible and persistent labels also support users with cognitive disabilities, low vision, or memory impairments. They reduce errors and make forms easier to complete, correct, and verify.\n\n## What to check for\n\n* Each form control has a visible label at all times.\n* Labels remain visible when the field is focused or filled.\n* Floating labels do not obscure or replace the label text.\n* Labels are not conveyed by placeholder text alone.\n* The visible label matches the programmatic accessible name.\n\n## What to avoid\n\n* Labels that disappear on focus or after input.\n* Using placeholder text as the only visible label.\n* Revealing labels only on hover or focus.\n* Relying on visual position or styling alone to convey meaning.\n\n## Related standards\n\n* WCAG 2.2 Success Criterion 1.3.1 Info and Relationships\n* WCAG 2.2 Success Criterion 3.3.2 Labels or Instructions\n* WCAG 2.2 Success Criterion 4.1.2 Name, Role, Value\n* EN 301 549 clause 9.1.3.1 Info and Relationships\n* EN 301 549 clause 9.3.3.2 Labels or Instructions\n* EN 301 549 clause 9.4.1.2 Name, Role, Value\n",
    "_searchMeta": {
      "cleanContent": "what this means form labels must be visible and remain present at all times users should be able to identify the purpose of each field before during and after interaction labels should not disappear when a field receives focus or when input is entered the label must remain available to support understanding and review why this matters screen reader users rely on labels to understand form fields consistently if labels are hidden or removed users may lose context when navigating or revisiting fields visible and persistent labels also support users with cognitive disabilities low vision or memory impairments they reduce errors and make forms easier to complete correct and verify what to check for each form control has a visible label at all times labels remain visible when the field is focused or filled floating labels do not obscure or replace the label text labels are not conveyed by placeholder text alone the visible label matches the programmatic accessible name what to avoid labels that disappear on focus or after input using placeholder text as the only visible label revealing labels only on hover or focus relying on visual position or styling alone to convey meaning related standards wcag 2 2 success criterion 1 3 1 info and relationships wcag 2 2 success criterion 3 3 2 labels or instructions wcag 2 2 success criterion 4 1 2 name role value en 301 549 clause 9 1 3 1 info and relationships en 301 549 clause 9 3 3 2 labels or instructions en 301 549 clause 9 4 1 2 name role value",
      "headings": [
        "What this means",
        "Why this matters",
        "What to check for",
        "What to avoid",
        "Related standards"
      ],
      "keywords": [
        "form labels",
        "persistent labels",
        "forms",
        "What this means",
        "Why this matters",
        "What to check for",
        "What to avoid",
        "Related standards"
      ]
    }
  },
  {
    "slug": "/meaningful-content/form-labels",
    "title": "Are form labels meaningful?",
    "description": "",
    "content": "## What this means\n\nEvery form control must have a label that clearly describes its purpose. The label should communicate what information is required or what action the control performs.\n\nMeaningful labels are provided through visible text or programmatic associations. This includes label elements, aria-label, or aria-labelledby when used correctly.\n\n## Why this matters\n\nScreen reader users rely on labels to understand form fields. If labels are missing, vague, or incorrect, users may not know what data to enter.\n\nClear labels also support keyboard users and users with cognitive disabilities. They reduce errors and make forms easier to complete and review.\n\n## What to check for\n\n* Each form control has a programmatically associated label.\n* Labels clearly describe the expected input or action.\n* Required fields are indicated in a way that is accessible.\n* Placeholder text is not used as a replacement for labels.\n* Assistive technologies announce an accurate and specific label.\n\n## What to avoid\n\n* Missing labels or labels that are visually hidden without an accessible name.\n* Generic labels such as “input” or “field.”\n* Using only placeholder text to describe a field.\n* Labels that do not match the actual purpose of the control.\n\n## Related standards\n\n* WCAG 2.2 Success Criterion 1.3.1 Info and Relationships\n* WCAG 2.2 Success Criterion 3.3.2 Labels or Instructions\n* WCAG 2.2 Success Criterion 4.1.2 Name, Role, Value\n* EN 301 549 clause 9.1.3.1 Info and Relationships\n* EN 301 549 clause 9.3.3.2 Labels or Instructions\n* EN 301 549 clause 9.4.1.2 Name, Role, Value\n\n```\n```\n",
    "_searchMeta": {
      "cleanContent": "what this means every form control must have a label that clearly describes its purpose the label should communicate what information is required or what action the control performs meaningful labels are provided through visible text or programmatic associations this includes label elements aria-label or aria-labelledby when used correctly why this matters screen reader users rely on labels to understand form fields if labels are missing vague or incorrect users may not know what data to enter clear labels also support keyboard users and users with cognitive disabilities they reduce errors and make forms easier to complete and review what to check for each form control has a programmatically associated label labels clearly describe the expected input or action required fields are indicated in a way that is accessible placeholder text is not used as a replacement for labels assistive technologies announce an accurate and specific label what to avoid missing labels or labels that are visually hidden without an accessible name generic labels such as input or field using only placeholder text to describe a field labels that do not match the actual purpose of the control related standards wcag 2 2 success criterion 1 3 1 info and relationships wcag 2 2 success criterion 3 3 2 labels or instructions wcag 2 2 success criterion 4 1 2 name role value en 301 549 clause 9 1 3 1 info and relationships en 301 549 clause 9 3 3 2 labels or instructions en 301 549 clause 9 4 1 2 name role value",
      "headings": [
        "What this means",
        "Why this matters",
        "What to check for",
        "What to avoid",
        "Related standards"
      ],
      "keywords": [
        "form labels",
        "accessible names",
        "forms",
        "What this means",
        "Why this matters",
        "What to check for",
        "What to avoid",
        "Related standards",
        ""
      ]
    }
  },
  {
    "slug": "/meaningful-content/images-of-text",
    "title": "Is real text used rather than images of text?",
    "description": "",
    "content": "## What this means\n\nText content should be implemented as actual text, not baked into images. Users must be able to resize, restyle, and access text through assistive technologies.\n\nImages of text should only be used when the text presentation is essential to the information being conveyed. This is typically limited to logos or cases where no alternative is possible.\n\n## Why this matters\n\nScreen readers cannot interpret text embedded in images unless an accurate text alternative is provided. Even with alternatives, images of text reduce flexibility and usability.\n\nReal text supports zooming, reflow, high contrast modes, and user-defined styles. It also improves readability for users with low vision, dyslexia, or cognitive disabilities.\n\n## What to check for\n\n* Headings, labels, instructions, and body content are implemented as text.\n* Text can be resized without loss of content or functionality.\n* Custom fonts and styles are applied using CSS, not images.\n* Text remains readable in high contrast and forced color modes.\n* Any image of text has an equivalent accessible text alternative.\n\n## What to avoid\n\n* Using images to display headings, paragraphs, or buttons.\n* Embedding critical instructions or data in images.\n* Relying on alt text to compensate for unnecessary images of text.\n* Preventing users from resizing or restyling text.\n\n## Related standards\n\n* WCAG 2.2 Success Criterion 1.4.5 Images of Text\n* WCAG 2.2 Success Criterion 1.4.4 Resize Text\n* EN 301 549 clause 9.1.4.5 Images of Text\n* EN 301 549 clause 9.1.4.4 Resize Text\n",
    "_searchMeta": {
      "cleanContent": "what this means text content should be implemented as actual text not baked into images users must be able to resize restyle and access text through assistive technologies images of text should only be used when the text presentation is essential to the information being conveyed this is typically limited to logos or cases where no alternative is possible why this matters screen readers cannot interpret text embedded in images unless an accurate text alternative is provided even with alternatives images of text reduce flexibility and usability real text supports zooming reflow high contrast modes and user-defined styles it also improves readability for users with low vision dyslexia or cognitive disabilities what to check for headings labels instructions and body content are implemented as text text can be resized without loss of content or functionality custom fonts and styles are applied using css not images text remains readable in high contrast and forced color modes any image of text has an equivalent accessible text alternative what to avoid using images to display headings paragraphs or buttons embedding critical instructions or data in images relying on alt text to compensate for unnecessary images of text preventing users from resizing or restyling text related standards wcag 2 2 success criterion 1 4 5 images of text wcag 2 2 success criterion 1 4 4 resize text en 301 549 clause 9 1 4 5 images of text en 301 549 clause 9 1 4 4 resize text",
      "headings": [
        "What this means",
        "Why this matters",
        "What to check for",
        "What to avoid",
        "Related standards"
      ],
      "keywords": [
        "real text",
        "images of text",
        "scalability",
        "What this means",
        "Why this matters",
        "What to check for",
        "What to avoid",
        "Related standards"
      ]
    }
  },
  {
    "slug": "/meaningful-content",
    "title": "Meaningful Content",
    "description": "Heuristics for clear, understandable information for all users",
    "content": "# Meaningful Content\n\nThis category covers heuristics that ensure content is clear, descriptive, and understandable to all users, regardless of how they access it.\n\n## Why this matters\n\nContent must be self-explanatory and provide sufficient context for users to:\n\n* Understand what interactive elements do\n* Navigate efficiently through pages and forms\n* Make informed decisions\n* Access information regardless of sensory ability\n\nMeaningful content reduces confusion, prevents errors, and ensures everyone can use your interface effectively.\n\n## Heuristics in this category\n\nThis category contains 7 heuristics covering content clarity and meaningfulness.\n",
    "_searchMeta": {
      "cleanContent": "meaningful content this category covers heuristics that ensure content is clear descriptive and understandable to all users regardless of how they access it why this matters content must be self-explanatory and provide sufficient context for users to: understand what interactive elements do navigate efficiently through pages and forms make informed decisions access information regardless of sensory ability meaningful content reduces confusion prevents errors and ensures everyone can use your interface effectively heuristics in this category this category contains 7 heuristics covering content clarity and meaningfulness",
      "headings": ["Why this matters", "Heuristics in this category"],
      "keywords": [
        "content",
        "clarity",
        "labels",
        "meaningful",
        "understandable",
        "Why this matters",
        "Heuristics in this category"
      ]
    }
  },
  {
    "slug": "/meaningful-content/meaningful-link-text",
    "title": "Do all links have meaningful link text?",
    "description": "",
    "content": "## What this means\n\nEvery link must have text that clearly describes its destination or purpose. The link text should make sense on its own without relying on surrounding content.\n\nMeaningful link text is provided through visible text or an accessible name. This includes text content, aria-label, or aria-labelledby when appropriate.\n\n## Why this matters\n\nScreen reader users often navigate by links. When link text is vague or repetitive, it becomes difficult to understand where a link goes.\n\nMeaningful link text also supports keyboard users and users with cognitive disabilities. Clear labels reduce confusion and improve efficiency when scanning or navigating a page.\n\n## What to check for\n\n* Link text describes the destination, action, or result.\n* Links with the same destination use consistent text.\n* Icon-only links have an accessible name that conveys purpose.\n* Links remain understandable when read out of context.\n* Assistive technologies announce a clear and specific link name.\n\n## What to avoid\n\n* Generic text such as “click here” or “read more.”\n* Repeating identical link text for different destinations.\n* Relying on surrounding text alone to explain a link’s purpose.\n* Using URLs as link text when they are not meaningful to users.\n\n## Related standards\n\n* WCAG 2.2 Success Criterion 2.4.4 Link Purpose (In Context)\n* WCAG 2.2 Success Criterion 2.4.9 Link Purpose (Link Only)\n* EN 301 549 clause 9.2.4.4 Link Purpose (In Context)\n* EN 301 549 clause 11.2.4.4 Link Purpose (In Context)\n",
    "_searchMeta": {
      "cleanContent": "what this means every link must have text that clearly describes its destination or purpose the link text should make sense on its own without relying on surrounding content meaningful link text is provided through visible text or an accessible name this includes text content aria-label or aria-labelledby when appropriate why this matters screen reader users often navigate by links when link text is vague or repetitive it becomes difficult to understand where a link goes meaningful link text also supports keyboard users and users with cognitive disabilities clear labels reduce confusion and improve efficiency when scanning or navigating a page what to check for link text describes the destination action or result links with the same destination use consistent text icon-only links have an accessible name that conveys purpose links remain understandable when read out of context assistive technologies announce a clear and specific link name what to avoid generic text such as click here or read more repeating identical link text for different destinations relying on surrounding text alone to explain a link s purpose using urls as link text when they are not meaningful to users related standards wcag 2 2 success criterion 2 4 4 link purpose in context wcag 2 2 success criterion 2 4 9 link purpose link only en 301 549 clause 9 2 4 4 link purpose in context en 301 549 clause 11 2 4 4 link purpose in context",
      "headings": [
        "What this means",
        "Why this matters",
        "What to check for",
        "What to avoid",
        "Related standards"
      ],
      "keywords": [
        "link text",
        "accessible names",
        "navigation",
        "What this means",
        "Why this matters",
        "What to check for",
        "What to avoid",
        "Related standards"
      ]
    }
  },
  {
    "slug": "/meaningful-content/recurring-nav",
    "title": "Are recurring navigation patterns and functionalities presented and labeled consistently throughout the system?",
    "description": "",
    "content": "## What this means\n\nRecurring navigation patterns and shared functionalities should be presented in a consistent way wherever they appear. Users encounter the same structure, placement, and labeling for navigation and common actions across the system.\n\nConsistency applies to how components look, how they behave, and how they are named. A control that performs the same function should not change its appearance, interaction, or label based on location.\n\nAccessible names and programmatic labels follow the same consistency. Assistive technologies announce the same control using the same name and role across contexts.\n\n## Why this matters\n\nUsers build mental models as they move through an interface. When navigation patterns or labels change unexpectedly, those models break and users must slow down to reorient themselves.\n\nInconsistent labeling can cause screen reader users to interpret identical actions as different controls. This increases cognitive load and can lead to errors or hesitation during task completion.\n\nConsistent patterns support predictability and efficiency. They reduce the effort required to learn and use the interface, particularly for users with cognitive disabilities or those relying on assistive technologies.\n\n## What to check for\n\n* Navigation structures remain stable across pages that serve similar purposes.\n* Identical actions use the same visible text and accessible name wherever they appear.\n* Repeated components behave the same way for mouse, keyboard, and touch interactions.\n* Icons representing the same function are paired with consistent text or accessible labels.\n* Roles, states, and properties exposed to assistive technologies do not vary between instances.\n\n## What to avoid\n\n* Changing labels for the same action without a clear and necessary distinction.\n* Moving or restructuring navigation in similar views without user benefit.\n* Using different visual treatments to represent the same functionality.\n* Implementing repeated components with different accessibility semantics.\n\n## Related standards\n\n* EN 301 549: 9.3.2.3 Consistent navigation\n* EN 301 549: 9.3.2.4 Consistent identification\n* WCAG 2.2: 3.2.3 Consistent Navigation\n* WCAG 2.2: 3.2.4 Consistent Identification\n",
    "_searchMeta": {
      "cleanContent": "what this means recurring navigation patterns and shared functionalities should be presented in a consistent way wherever they appear users encounter the same structure placement and labeling for navigation and common actions across the system consistency applies to how components look how they behave and how they are named a control that performs the same function should not change its appearance interaction or label based on location accessible names and programmatic labels follow the same consistency assistive technologies announce the same control using the same name and role across contexts why this matters users build mental models as they move through an interface when navigation patterns or labels change unexpectedly those models break and users must slow down to reorient themselves inconsistent labeling can cause screen reader users to interpret identical actions as different controls this increases cognitive load and can lead to errors or hesitation during task completion consistent patterns support predictability and efficiency they reduce the effort required to learn and use the interface particularly for users with cognitive disabilities or those relying on assistive technologies what to check for navigation structures remain stable across pages that serve similar purposes identical actions use the same visible text and accessible name wherever they appear repeated components behave the same way for mouse keyboard and touch interactions icons representing the same function are paired with consistent text or accessible labels roles states and properties exposed to assistive technologies do not vary between instances what to avoid changing labels for the same action without a clear and necessary distinction moving or restructuring navigation in similar views without user benefit using different visual treatments to represent the same functionality implementing repeated components with different accessibility semantics related standards en 301 549: 9 3 2 3 consistent navigation en 301 549: 9 3 2 4 consistent identification wcag 2 2: 3 2 3 consistent navigation wcag 2 2: 3 2 4 consistent identification",
      "headings": [
        "What this means",
        "Why this matters",
        "What to check for",
        "What to avoid",
        "Related standards"
      ],
      "keywords": [
        "meaningful content",
        "consistent navigation",
        "consistent identification",
        "navigation",
        "labeling",
        "What this means",
        "Why this matters",
        "What to check for",
        "What to avoid",
        "Related standards"
      ]
    }
  },
  {
    "slug": "/meaningful-content/single-cta",
    "title": "Are adjacent links pointing to unique locations combined into a single CTA?",
    "description": "",
    "content": "## What this means\n\nWhen multiple links or interactive elements are placed next to each other and all lead to the same destination or closely related destinations, they should be combined into a single, clear call to action.\n\nAdjacent links that appear separate but perform the same action can create confusion about what is clickable and where an action will lead. It also creates unnecessary steps for keyboard users. A single, well defined CTA reduces ambiguity and simplifies interaction.\n\nThis applies to text links, buttons, icons, cards, headlines with links, and any other interactive elements that are visually grouped.\n\n## Why this matters\n\nScreen reader and keyboard users encounter each interactive element individually. When several adjacent links point to the same or similar destination, users may have to navigate through redundant options that do not provide additional value.\n\nRedundant links increase cognitive load and slow down navigation. This makes it harder to understand the structure and purpose of the content. This can be especially frustrating for users who rely on keyboard navigation or screen reader link lists.\n\nCombining adjacent links into a single CTA improves clarity and reduces unnecessary focus stops. This creates a more predictable and efficient experience for all users.\n\n## What to check for\n\n* Are there multiple adjacent links or clickable elements that navigate to the same page or perform the same action?\n* Do linked headlines, images, and supporting text all point to the same destination without being grouped into a single interactive element?\n* Can the number of focusable elements be reduced without removing meaningful choices?\n\n## What to avoid\n\n* Placing several links next to each other that all lead to the same destination.\n* Making entire content blocks partially clickable while also including separate links inside them that perform the same action.\n* Repeating the same CTA multiple times in close proximity without adding clarity or choice.\n* Creating extra focus stops that do not provide additional information or control.\n\n## Related standards\n\n* WCAG 2.1 Success Criterion 2.4.4 Link Purpose (In Context)\n* WCAG 2.1 Success Criterion 2.4.6 Headings and Labels\n* WCAG 2.1 Success Criterion 2.1.1 Keyboard\n* EN 301 549 clause 9.2.4.4 Link Purpose (In Context)\n* EN 301 549 clause 9.2.4.3 Focus Order\n* EN 301 549 clause 9.2.1.1 Keyboard\n",
    "_searchMeta": {
      "cleanContent": "what this means when multiple links or interactive elements are placed next to each other and all lead to the same destination or closely related destinations they should be combined into a single clear call to action adjacent links that appear separate but perform the same action can create confusion about what is clickable and where an action will lead it also creates unnecessary steps for keyboard users a single well defined cta reduces ambiguity and simplifies interaction this applies to text links buttons icons cards headlines with links and any other interactive elements that are visually grouped why this matters screen reader and keyboard users encounter each interactive element individually when several adjacent links point to the same or similar destination users may have to navigate through redundant options that do not provide additional value redundant links increase cognitive load and slow down navigation this makes it harder to understand the structure and purpose of the content this can be especially frustrating for users who rely on keyboard navigation or screen reader link lists combining adjacent links into a single cta improves clarity and reduces unnecessary focus stops this creates a more predictable and efficient experience for all users what to check for are there multiple adjacent links or clickable elements that navigate to the same page or perform the same action do linked headlines images and supporting text all point to the same destination without being grouped into a single interactive element can the number of focusable elements be reduced without removing meaningful choices what to avoid placing several links next to each other that all lead to the same destination making entire content blocks partially clickable while also including separate links inside them that perform the same action repeating the same cta multiple times in close proximity without adding clarity or choice creating extra focus stops that do not provide additional information or control related standards wcag 2 1 success criterion 2 4 4 link purpose in context wcag 2 1 success criterion 2 4 6 headings and labels wcag 2 1 success criterion 2 1 1 keyboard en 301 549 clause 9 2 4 4 link purpose in context en 301 549 clause 9 2 4 3 focus order en 301 549 clause 9 2 1 1 keyboard",
      "headings": [
        "What this means",
        "Why this matters",
        "What to check for",
        "What to avoid",
        "Related standards"
      ],
      "keywords": [
        "links",
        "CTA",
        "navigation",
        "redundant links",
        "accessibility",
        "What this means",
        "Why this matters",
        "What to check for",
        "What to avoid",
        "Related standards"
      ]
    }
  },
  {
    "slug": "/page-structure/content-regions",
    "title": "Is all content placed within a landmark or region?",
    "description": "",
    "content": "## What this means\n\nPage content must be contained within appropriate landmarks or regions. Landmarks define the overall structure of the page and help users understand how content is organized.\n\nCommon landmarks include header, navigation, main, complementary, and footer. Custom regions may also be used when native landmarks are not sufficient.\n\n## Why this matters\n\nScreen reader users rely on landmarks to navigate pages efficiently. When content exists outside of landmarks, it may be harder to find or understand in context.\n\nLandmarks also support keyboard users and users with cognitive disabilities. A clear structure improves orientation and reduces the effort required to move through content.\n\n## What to check for\n\n* All visible content is contained within a landmark or region.\n* Each landmark has a clear and appropriate role.\n* The main content is contained within a single main landmark.\n* Repeated content uses consistent landmarks across pages.\n* Assistive technologies can identify and navigate landmarks.\n\n## What to avoid\n\n* Placing content outside of any landmark or region.\n* Using multiple main landmarks on the same page.\n* Applying landmark roles purely for visual grouping.\n* Creating regions without an accessible name when required.\n\n## Related standards\n\n* WCAG 2.2 Success Criterion 1.3.1 Info and Relationships\n* WCAG 2.2 Success Criterion 2.4.1 Bypass Blocks\n* EN 301 549 clause 9.1.3.1 Info and Relationships\n* EN 301 549 clause 9.2.4.1 Bypass Blocks\n",
    "_searchMeta": {
      "cleanContent": "what this means page content must be contained within appropriate landmarks or regions landmarks define the overall structure of the page and help users understand how content is organized common landmarks include header navigation main complementary and footer custom regions may also be used when native landmarks are not sufficient why this matters screen reader users rely on landmarks to navigate pages efficiently when content exists outside of landmarks it may be harder to find or understand in context landmarks also support keyboard users and users with cognitive disabilities a clear structure improves orientation and reduces the effort required to move through content what to check for all visible content is contained within a landmark or region each landmark has a clear and appropriate role the main content is contained within a single main landmark repeated content uses consistent landmarks across pages assistive technologies can identify and navigate landmarks what to avoid placing content outside of any landmark or region using multiple main landmarks on the same page applying landmark roles purely for visual grouping creating regions without an accessible name when required related standards wcag 2 2 success criterion 1 3 1 info and relationships wcag 2 2 success criterion 2 4 1 bypass blocks en 301 549 clause 9 1 3 1 info and relationships en 301 549 clause 9 2 4 1 bypass blocks",
      "headings": [
        "What this means",
        "Why this matters",
        "What to check for",
        "What to avoid",
        "Related standards"
      ],
      "keywords": [
        "landmarks",
        "regions",
        "page structure",
        "What this means",
        "Why this matters",
        "What to check for",
        "What to avoid",
        "Related standards"
      ]
    }
  },
  {
    "slug": "/page-structure/cta-buttons",
    "title": "Are buttons used for CTAs that trigger functionalities within the page?",
    "description": "",
    "content": "## What this means\n\nCalls to action that trigger functionality on the current page should be implemented as buttons. The semantic role must match the behavior the user initiates.\n\nButtons are used for actions such as submitting a form, opening a dialog, toggling content, or updating data without navigating away.\n\n## Why this matters\n\nAssistive technology users rely on semantics to understand what will happen when an element is activated. When buttons are correctly used, expectations are clear and interactions are predictable.\n\nScreen reader users often navigate by controls such as buttons. Keyboard users depend on consistent activation and focus behavior for in-page actions.\n\n## What to check for\n\n* CTAs that trigger in-page actions are implemented as buttons.\n* Button semantics are preserved even when visually styled as links.\n* Buttons expose an accessible name that describes the action.\n* Assistive technologies announce the element as a button.\n* Keyboard activation triggers the intended functionality.\n\n## What to avoid\n\n* Using links to trigger in-page functionality.\n* Changing application state through elements exposed as links.\n* Removing button semantics for visual styling purposes.\n* Creating custom controls that do not expose the correct role.\n\n## Related standards\n\n* WCAG 2.2 Success Criterion 1.3.1 Info and Relationships\n* WCAG 2.2 Success Criterion 4.1.2 Name, Role, Value\n* EN 301 549 clause 9.1.3.1 Info and Relationships\n* EN 301 549 clause 9.4.1.2 Name, Role, Value\n",
    "_searchMeta": {
      "cleanContent": "what this means calls to action that trigger functionality on the current page should be implemented as buttons the semantic role must match the behavior the user initiates buttons are used for actions such as submitting a form opening a dialog toggling content or updating data without navigating away why this matters assistive technology users rely on semantics to understand what will happen when an element is activated when buttons are correctly used expectations are clear and interactions are predictable screen reader users often navigate by controls such as buttons keyboard users depend on consistent activation and focus behavior for in-page actions what to check for ctas that trigger in-page actions are implemented as buttons button semantics are preserved even when visually styled as links buttons expose an accessible name that describes the action assistive technologies announce the element as a button keyboard activation triggers the intended functionality what to avoid using links to trigger in-page functionality changing application state through elements exposed as links removing button semantics for visual styling purposes creating custom controls that do not expose the correct role related standards wcag 2 2 success criterion 1 3 1 info and relationships wcag 2 2 success criterion 4 1 2 name role value en 301 549 clause 9 1 3 1 info and relationships en 301 549 clause 9 4 1 2 name role value",
      "headings": [
        "What this means",
        "Why this matters",
        "What to check for",
        "What to avoid",
        "Related standards"
      ],
      "keywords": [
        "buttons",
        "calls to action",
        "functionality",
        "What this means",
        "Why this matters",
        "What to check for",
        "What to avoid",
        "Related standards"
      ]
    }
  },
  {
    "slug": "/page-structure/cta-links",
    "title": "Are links used for CTAs that take the user to a different location?",
    "description": "",
    "content": "## What this means\n\nCalls to action that move the user to a different page, view, or location should be implemented as links. The semantic role must match the behavior.\n\nLinks are used for navigation. Buttons are used for actions that change state, submit data, or trigger behavior on the current page.\n\n## Why this matters\n\nAssistive technology users rely on semantics to understand what will happen when an element is activated. When links and buttons are misused, expectations are broken.\n\nScreen reader users often navigate by links to explore destinations. Keyboard users depend on consistent behavior when activating interactive elements.\n\n## What to check for\n\n* CTAs that navigate to another page are implemented as links.\n* Link semantics are preserved even when styled as buttons.\n* Buttons are reserved for actions that do not change location.\n* Assistive technologies announce links as links.\n* Keyboard activation follows expected link behavior.\n\n## What to avoid\n\n* Using buttons to navigate to a new page or view.\n* Changing location as a side effect of a button action.\n* Removing link semantics for visual styling purposes.\n* Creating custom elements that do not expose the correct role.\n\n## Related standards\n\n* WCAG 2.2 Success Criterion 1.3.1 Info and Relationships\n* WCAG 2.2 Success Criterion 2.4.4 Link Purpose (In Context)\n* WCAG 2.2 Success Criterion 4.1.2 Name, Role, Value\n* EN 301 549 clause 9.1.3.1 Info and Relationships\n* EN 301 549 clause 9.2.4.4 Link Purpose (In Context)\n* EN 301 549 clause 9.4.1.2 Name, Role, Value\n",
    "_searchMeta": {
      "cleanContent": "what this means calls to action that move the user to a different page view or location should be implemented as links the semantic role must match the behavior links are used for navigation buttons are used for actions that change state submit data or trigger behavior on the current page why this matters assistive technology users rely on semantics to understand what will happen when an element is activated when links and buttons are misused expectations are broken screen reader users often navigate by links to explore destinations keyboard users depend on consistent behavior when activating interactive elements what to check for ctas that navigate to another page are implemented as links link semantics are preserved even when styled as buttons buttons are reserved for actions that do not change location assistive technologies announce links as links keyboard activation follows expected link behavior what to avoid using buttons to navigate to a new page or view changing location as a side effect of a button action removing link semantics for visual styling purposes creating custom elements that do not expose the correct role related standards wcag 2 2 success criterion 1 3 1 info and relationships wcag 2 2 success criterion 2 4 4 link purpose in context wcag 2 2 success criterion 4 1 2 name role value en 301 549 clause 9 1 3 1 info and relationships en 301 549 clause 9 2 4 4 link purpose in context en 301 549 clause 9 4 1 2 name role value",
      "headings": [
        "What this means",
        "Why this matters",
        "What to check for",
        "What to avoid",
        "Related standards"
      ],
      "keywords": [
        "links",
        "calls to action",
        "navigation",
        "What this means",
        "Why this matters",
        "What to check for",
        "What to avoid",
        "Related standards"
      ]
    }
  },
  {
    "slug": "/page-structure/heading-hierarchy",
    "title": "Do section headings follow a hierarchical structure and do not skip any levels?",
    "description": "",
    "content": "## What this means\n\nHeadings must follow a logical, hierarchical order that reflects the structure of the content. Each heading level represents a clear relationship to the content that follows it.\n\nHeading levels must not be skipped. Content should progress sequentially from higher-level headings to lower-level headings without jumping levels.\n\n## Why this matters\n\nScreen reader users rely on headings to understand page structure and to navigate efficiently. Skipped or misordered headings make content harder to follow and interpret.\n\nA consistent heading hierarchy also supports keyboard users and users with cognitive disabilities. Clear structure improves orientation and comprehension when scanning or navigating content.\n\n## What to check for\n\n* Headings are used to describe sections of content.\n* Heading levels follow a logical and sequential order.\n* No heading levels are skipped.\n* Visual styling does not replace proper heading markup.\n* Assistive technologies announce headings and their levels correctly.\n\n## What to avoid\n\n* Skipping heading levels to achieve visual styling.\n* Using headings purely for presentation.\n* Placing content under headings of an incorrect level.\n* Creating a flat structure where all headings use the same level.\n\n## Related standards\n\n* WCAG 2.2 Success Criterion 1.3.1 Info and Relationships\n* WCAG 2.2 Success Criterion 2.4.6 Headings and Labels\n* EN 301 549 clause 9.1.3.1 Info and Relationships\n* EN 301 549 clause 9.2.4.6 Headings and Labels\n",
    "_searchMeta": {
      "cleanContent": "what this means headings must follow a logical hierarchical order that reflects the structure of the content each heading level represents a clear relationship to the content that follows it heading levels must not be skipped content should progress sequentially from higher-level headings to lower-level headings without jumping levels why this matters screen reader users rely on headings to understand page structure and to navigate efficiently skipped or misordered headings make content harder to follow and interpret a consistent heading hierarchy also supports keyboard users and users with cognitive disabilities clear structure improves orientation and comprehension when scanning or navigating content what to check for headings are used to describe sections of content heading levels follow a logical and sequential order no heading levels are skipped visual styling does not replace proper heading markup assistive technologies announce headings and their levels correctly what to avoid skipping heading levels to achieve visual styling using headings purely for presentation placing content under headings of an incorrect level creating a flat structure where all headings use the same level related standards wcag 2 2 success criterion 1 3 1 info and relationships wcag 2 2 success criterion 2 4 6 headings and labels en 301 549 clause 9 1 3 1 info and relationships en 301 549 clause 9 2 4 6 headings and labels",
      "headings": [
        "What this means",
        "Why this matters",
        "What to check for",
        "What to avoid",
        "Related standards"
      ],
      "keywords": [
        "headings",
        "document structure",
        "hierarchy",
        "What this means",
        "Why this matters",
        "What to check for",
        "What to avoid",
        "Related standards"
      ]
    }
  },
  {
    "slug": "/page-structure",
    "title": "Page Structure",
    "description": "Heuristics for well-organized, semantic document structure",
    "content": "# Page Structure\n\nThis category covers heuristics that ensure pages are well-organized with clear, semantic structure that helps all users understand and navigate content.\n\n## Why this matters\n\nProper page structure:\n\n* Helps screen reader users navigate efficiently using headings and landmarks\n* Allows users to scan and understand content hierarchy\n* Enables browser features like outline views and \"skip to\" navigation\n* Improves SEO and content discoverability\n* Makes content easier to maintain and style\n\nA well-structured page is like a well-organized book with clear chapters and sections.\n\n## Heuristics in this category\n\nThis category contains 6 heuristics covering page organization and semantic structure.\n",
    "_searchMeta": {
      "cleanContent": "page structure this category covers heuristics that ensure pages are well-organized with clear semantic structure that helps all users understand and navigate content why this matters proper page structure: helps screen reader users navigate efficiently using headings and landmarks allows users to scan and understand content hierarchy enables browser features like outline views and skip to navigation improves seo and content discoverability makes content easier to maintain and style a well-structured page is like a well-organized book with clear chapters and sections heuristics in this category this category contains 6 heuristics covering page organization and semantic structure",
      "headings": ["Why this matters", "Heuristics in this category"],
      "keywords": [
        "structure",
        "headings",
        "landmarks",
        "semantic HTML",
        "page layout",
        "Why this matters",
        "Heuristics in this category"
      ]
    }
  },
  {
    "slug": "/page-structure/list-groupings",
    "title": "Are lists used to present groupings and enumerations?",
    "description": "",
    "content": "## What this means\n\nRelated items that form a group or sequence must be marked up as a list. Lists communicate relationships and order that are not clear from visual layout alone.\n\nOrdered lists are used when sequence or priority matters. Unordered lists are used when items are grouped without a required order.\n\n## Why this matters\n\nScreen reader users rely on list semantics to understand how items relate to one another. Lists provide context such as the number of items and the user’s position within the group.\n\nProper list structure also supports keyboard users and users with cognitive disabilities. Clear grouping improves scanning, comprehension, and navigation.\n\n## What to check for\n\n* Grouped or enumerated content is implemented using list elements.\n* The correct list type is used based on meaning and order.\n* Lists are not broken by unrelated content.\n* Nested lists reflect logical sub-groupings.\n* Assistive technologies announce list structure correctly.\n\n## What to avoid\n\n* Using line breaks or visual spacing instead of lists.\n* Simulating lists with icons, numbers, or styling alone.\n* Combining unrelated items into a single list.\n* Using lists purely for visual layout.\n\n## Related standards\n\n* WCAG 2.2 Success Criterion 1.3.1 Info and Relationships\n* WCAG 2.2 Success Criterion 2.4.6 Headings and Labels\n* EN 301 549 clause 9.1.3.1 Info and Relationships\n* EN 301 549 clause 9.2.4.6 Headings and Labels\n",
    "_searchMeta": {
      "cleanContent": "what this means related items that form a group or sequence must be marked up as a list lists communicate relationships and order that are not clear from visual layout alone ordered lists are used when sequence or priority matters unordered lists are used when items are grouped without a required order why this matters screen reader users rely on list semantics to understand how items relate to one another lists provide context such as the number of items and the user s position within the group proper list structure also supports keyboard users and users with cognitive disabilities clear grouping improves scanning comprehension and navigation what to check for grouped or enumerated content is implemented using list elements the correct list type is used based on meaning and order lists are not broken by unrelated content nested lists reflect logical sub-groupings assistive technologies announce list structure correctly what to avoid using line breaks or visual spacing instead of lists simulating lists with icons numbers or styling alone combining unrelated items into a single list using lists purely for visual layout related standards wcag 2 2 success criterion 1 3 1 info and relationships wcag 2 2 success criterion 2 4 6 headings and labels en 301 549 clause 9 1 3 1 info and relationships en 301 549 clause 9 2 4 6 headings and labels",
      "headings": [
        "What this means",
        "Why this matters",
        "What to check for",
        "What to avoid",
        "Related standards"
      ],
      "keywords": [
        "lists",
        "content structure",
        "semantics",
        "What this means",
        "Why this matters",
        "What to check for",
        "What to avoid",
        "Related standards"
      ]
    }
  },
  {
    "slug": "/page-structure/page-titles",
    "title": "Does each page have a meaningful title?",
    "description": "",
    "content": "## What this means\n\nEach page must have a title that clearly describes its content or purpose. The title is provided programmatically and is exposed to browsers and assistive technologies.\n\nA meaningful page title reflects the primary topic or task of the page. It should be concise and specific.\n\n## Why this matters\n\nScreen reader users rely on page titles to understand where they are and to move between pages efficiently. When titles are missing or vague, orientation and navigation become difficult.\n\nMeaningful titles also support keyboard users and users with cognitive disabilities. Clear titles improve comprehension when switching tabs, using history, or reviewing open pages.\n\n## What to check for\n\n* Every page has a programmatic title.\n* The title accurately describes the page’s main content or function.\n* Titles are unique across the site where pages serve different purposes.\n* Dynamic pages update the title when the primary content changes.\n* Assistive technologies announce the correct page title.\n\n## What to avoid\n\n* Missing or empty page titles.\n* Generic titles such as “Home” or “Page” without context.\n* Reusing the same title across multiple distinct pages.\n* Titles that do not reflect the current page state or content.\n\n## Related standards\n\n* WCAG 2.2 Success Criterion 2.4.2 Page Titled\n* EN 301 549 clause 9.2.4.2 Page Titled\n",
    "_searchMeta": {
      "cleanContent": "what this means each page must have a title that clearly describes its content or purpose the title is provided programmatically and is exposed to browsers and assistive technologies a meaningful page title reflects the primary topic or task of the page it should be concise and specific why this matters screen reader users rely on page titles to understand where they are and to move between pages efficiently when titles are missing or vague orientation and navigation become difficult meaningful titles also support keyboard users and users with cognitive disabilities clear titles improve comprehension when switching tabs using history or reviewing open pages what to check for every page has a programmatic title the title accurately describes the page s main content or function titles are unique across the site where pages serve different purposes dynamic pages update the title when the primary content changes assistive technologies announce the correct page title what to avoid missing or empty page titles generic titles such as home or page without context reusing the same title across multiple distinct pages titles that do not reflect the current page state or content related standards wcag 2 2 success criterion 2 4 2 page titled en 301 549 clause 9 2 4 2 page titled",
      "headings": [
        "What this means",
        "Why this matters",
        "What to check for",
        "What to avoid",
        "Related standards"
      ],
      "keywords": [
        "page titles",
        "document titles",
        "navigation",
        "What this means",
        "Why this matters",
        "What to check for",
        "What to avoid",
        "Related standards"
      ]
    }
  },
  {
    "slug": "/quality-of-life/audio-description",
    "title": "Do pre-recorded videos have an audio description of visual content?",
    "description": "",
    "content": "## What this means\n\nPre-recorded videos must include audio descriptions for important visual information that is not conveyed through dialogue. Audio description provides spoken narration of visual content that is necessary to understand the video.\n\nThe description must be available in a way that can be perceived by assistive technologies and users who cannot see the visual content.\n\n## Why this matters\n\nBlind and low vision users cannot perceive visual-only information such as actions, settings, or on-screen text. Without audio description, key context or meaning may be lost.\n\nAudio description also supports users who are multitasking or cannot view the screen. It ensures that the full message of the video is accessible without relying on sight.\n\n## What to check for\n\n* Important visual information is described in audio.\n* Descriptions are synchronized with the video.\n* Audio descriptions do not overlap critical dialogue.\n* On-screen text is included in the audio description when needed.\n* Users can access the audio-described version of the video.\n\n## What to avoid\n\n* Relying on visuals alone to convey essential information.\n* Omitting descriptions of actions, scene changes, or visual cues.\n* Providing descriptions that are incomplete or unclear.\n* Assuming dialogue alone conveys all necessary context.\n\n## Related standards\n\n* WCAG 2.2 Success Criterion 1.2.5 Audio Description (Prerecorded)\n* WCAG 2.2 Success Criterion 1.2.3 Audio Description or Media Alternative (Prerecorded)\n* EN 301 549 clause 9.1.2.5 Audio Description (Prerecorded)\n* EN 301 549 clause 9.1.2.3 Audio Description or Media Alternative (Prerecorded)\n",
    "_searchMeta": {
      "cleanContent": "what this means pre-recorded videos must include audio descriptions for important visual information that is not conveyed through dialogue audio description provides spoken narration of visual content that is necessary to understand the video the description must be available in a way that can be perceived by assistive technologies and users who cannot see the visual content why this matters blind and low vision users cannot perceive visual-only information such as actions settings or on-screen text without audio description key context or meaning may be lost audio description also supports users who are multitasking or cannot view the screen it ensures that the full message of the video is accessible without relying on sight what to check for important visual information is described in audio descriptions are synchronized with the video audio descriptions do not overlap critical dialogue on-screen text is included in the audio description when needed users can access the audio-described version of the video what to avoid relying on visuals alone to convey essential information omitting descriptions of actions scene changes or visual cues providing descriptions that are incomplete or unclear assuming dialogue alone conveys all necessary context related standards wcag 2 2 success criterion 1 2 5 audio description prerecorded wcag 2 2 success criterion 1 2 3 audio description or media alternative prerecorded en 301 549 clause 9 1 2 5 audio description prerecorded en 301 549 clause 9 1 2 3 audio description or media alternative prerecorded",
      "headings": [
        "What this means",
        "Why this matters",
        "What to check for",
        "What to avoid",
        "Related standards"
      ],
      "keywords": [
        "audio description",
        "video",
        "pre-recorded media",
        "What this means",
        "Why this matters",
        "What to check for",
        "What to avoid",
        "Related standards"
      ]
    }
  },
  {
    "slug": "/quality-of-life/error-suggestions",
    "title": "Are error correction suggestions provided?",
    "description": "",
    "content": "## What this means\n\nWhen an error occurs, users are given clear suggestions on how to fix it. The guidance explains what needs to change, not just that something is wrong.\n\nSuggestions are provided in text and are available to assistive technologies. They are presented at the time the error is identified.\n\n## Why this matters\n\nScreen reader users need explicit guidance to understand how to recover from errors. Error messages without suggestions can leave users unsure how to proceed.\n\nClear correction guidance also supports users with cognitive disabilities and users unfamiliar with the task. It reduces trial and error and improves task completion rates.\n\n## What to check for\n\n* Error messages include specific suggestions for correction.\n* Suggestions describe how to resolve the error.\n* Guidance is provided in text and announced by assistive technologies.\n* Suggestions are relevant to the specific error condition.\n* Users can correct errors without guessing.\n\n## What to avoid\n\n* Identifying errors without explaining how to fix them.\n* Using vague guidance such as “invalid input.”\n* Providing suggestions that are not actionable.\n* Requiring users to infer corrections from visual cues alone.\n\n## Related standards\n\n* WCAG 2.2 Success Criterion 3.3.3 Error Suggestion\n* EN 301 549 clause 9.3.3.3 Error Suggestion\n",
    "_searchMeta": {
      "cleanContent": "what this means when an error occurs users are given clear suggestions on how to fix it the guidance explains what needs to change not just that something is wrong suggestions are provided in text and are available to assistive technologies they are presented at the time the error is identified why this matters screen reader users need explicit guidance to understand how to recover from errors error messages without suggestions can leave users unsure how to proceed clear correction guidance also supports users with cognitive disabilities and users unfamiliar with the task it reduces trial and error and improves task completion rates what to check for error messages include specific suggestions for correction suggestions describe how to resolve the error guidance is provided in text and announced by assistive technologies suggestions are relevant to the specific error condition users can correct errors without guessing what to avoid identifying errors without explaining how to fix them using vague guidance such as invalid input providing suggestions that are not actionable requiring users to infer corrections from visual cues alone related standards wcag 2 2 success criterion 3 3 3 error suggestion en 301 549 clause 9 3 3 3 error suggestion",
      "headings": [
        "What this means",
        "Why this matters",
        "What to check for",
        "What to avoid",
        "Related standards"
      ],
      "keywords": [
        "error correction",
        "form validation",
        "user guidance",
        "What this means",
        "Why this matters",
        "What to check for",
        "What to avoid",
        "Related standards"
      ]
    }
  },
  {
    "slug": "/quality-of-life",
    "title": "Quality of Life",
    "description": "Heuristics for enhanced usability and user experience",
    "content": "# Quality of Life\n\nThis category covers heuristics that enhance the overall user experience, making interfaces more convenient, efficient, and pleasant to use.\n\n## Why this matters\n\nQuality of life improvements:\n\n* Reduce cognitive load and user frustration\n* Make tasks faster and more efficient to complete\n* Accommodate different user preferences and contexts\n* Prevent common errors and help users recover gracefully\n* Build trust and satisfaction with your product\n\nThese heuristics go beyond basic accessibility to create genuinely delightful experiences.\n\n## Heuristics in this category\n\nThis category contains 7 heuristics covering usability enhancements and user experience improvements.\n",
    "_searchMeta": {
      "cleanContent": "quality of life this category covers heuristics that enhance the overall user experience making interfaces more convenient efficient and pleasant to use why this matters quality of life improvements: reduce cognitive load and user frustration make tasks faster and more efficient to complete accommodate different user preferences and contexts prevent common errors and help users recover gracefully build trust and satisfaction with your product these heuristics go beyond basic accessibility to create genuinely delightful experiences heuristics in this category this category contains 7 heuristics covering usability enhancements and user experience improvements",
      "headings": ["Why this matters", "Heuristics in this category"],
      "keywords": [
        "usability",
        "user experience",
        "UX",
        "quality of life",
        "convenience",
        "Why this matters",
        "Heuristics in this category"
      ]
    }
  },
  {
    "slug": "/quality-of-life/pause-animation",
    "title": "Can users pause, stop, or hide animated content that continues for over 5 seconds?",
    "description": "",
    "content": "## What this means\n\nAnimated content that starts automatically and continues for more than five seconds must be controllable by the user. Users must be able to pause, stop, or hide the animation.\n\nThis applies to animations, carousels, auto-updating content, and other moving elements that are not essential to the task.\n\n## Why this matters\n\nContinuous motion can be distracting or disorienting. Users with cognitive disabilities may have difficulty focusing when animations cannot be controlled.\n\nUsers with vestibular disorders may experience discomfort from motion. Screen reader and keyboard users also benefit when content does not change unexpectedly.\n\n## What to check for\n\n* Animations lasting longer than five seconds can be paused, stopped, or hidden.\n* Controls are easy to find and operate.\n* Controls are accessible by keyboard and assistive technologies.\n* Pausing the animation does not remove access to content.\n* Essential animations are limited and justified.\n\n## What to avoid\n\n* Auto-playing animations with no user controls.\n* Hiding controls until hover or focus only.\n* Restarting animations automatically after being paused.\n* Using motion when a static alternative would suffice.\n\n## Related standards\n\n* WCAG 2.2 Success Criterion 2.2.2 Pause, Stop, Hide\n* EN 301 549 clause 9.2.2.2 Pause, Stop, Hide\n",
    "_searchMeta": {
      "cleanContent": "what this means animated content that starts automatically and continues for more than five seconds must be controllable by the user users must be able to pause stop or hide the animation this applies to animations carousels auto-updating content and other moving elements that are not essential to the task why this matters continuous motion can be distracting or disorienting users with cognitive disabilities may have difficulty focusing when animations cannot be controlled users with vestibular disorders may experience discomfort from motion screen reader and keyboard users also benefit when content does not change unexpectedly what to check for animations lasting longer than five seconds can be paused stopped or hidden controls are easy to find and operate controls are accessible by keyboard and assistive technologies pausing the animation does not remove access to content essential animations are limited and justified what to avoid auto-playing animations with no user controls hiding controls until hover or focus only restarting animations automatically after being paused using motion when a static alternative would suffice related standards wcag 2 2 success criterion 2 2 2 pause stop hide en 301 549 clause 9 2 2 2 pause stop hide",
      "headings": [
        "What this means",
        "Why this matters",
        "What to check for",
        "What to avoid",
        "Related standards"
      ],
      "keywords": [
        "animation",
        "motion control",
        "timing",
        "What this means",
        "Why this matters",
        "What to check for",
        "What to avoid",
        "Related standards"
      ]
    }
  },
  {
    "slug": "/quality-of-life/session-extension",
    "title": "Can users turn off, adjust, or extend time limits before the session runs out?",
    "description": "",
    "content": "## What this means\n\nWhen content or functionality has a time limit, users must be able to control it. Users should be able to turn off the time limit, adjust it, or extend it before it expires.\n\nTime limits include session timeouts, auto-logout behavior, and timed interactions. Exceptions apply only when the time limit is essential to the activity.\n\n## Why this matters\n\nUsers with disabilities may need more time to read, understand, or complete tasks. Fixed time limits can prevent task completion or cause loss of data.\n\nScreen reader users, keyboard users, and users with cognitive or motor disabilities are particularly affected. Providing control over time limits supports successful and independent use.\n\n## What to check for\n\n* Users are warned before a time limit expires.\n* Users can extend or disable the time limit.\n* Instructions for managing time limits are clear and accessible.\n* Assistive technologies can access and operate time controls.\n* Essential time limits are clearly justified.\n\n## What to avoid\n\n* Ending sessions without warning.\n* Providing no way to extend or control time limits.\n* Resetting time limits without user action.\n* Hiding time controls from keyboard or assistive technology users.\n\n## Related standards\n\n* WCAG 2.2 Success Criterion 2.2.1 Timing Adjustable\n* EN 301 549 clause 9.2.2.1 Timing Adjustable\n",
    "_searchMeta": {
      "cleanContent": "what this means when content or functionality has a time limit users must be able to control it users should be able to turn off the time limit adjust it or extend it before it expires time limits include session timeouts auto-logout behavior and timed interactions exceptions apply only when the time limit is essential to the activity why this matters users with disabilities may need more time to read understand or complete tasks fixed time limits can prevent task completion or cause loss of data screen reader users keyboard users and users with cognitive or motor disabilities are particularly affected providing control over time limits supports successful and independent use what to check for users are warned before a time limit expires users can extend or disable the time limit instructions for managing time limits are clear and accessible assistive technologies can access and operate time controls essential time limits are clearly justified what to avoid ending sessions without warning providing no way to extend or control time limits resetting time limits without user action hiding time controls from keyboard or assistive technology users related standards wcag 2 2 success criterion 2 2 1 timing adjustable en 301 549 clause 9 2 2 1 timing adjustable",
      "headings": [
        "What this means",
        "Why this matters",
        "What to check for",
        "What to avoid",
        "Related standards"
      ],
      "keywords": [
        "time limits",
        "timeouts",
        "user control",
        "What this means",
        "Why this matters",
        "What to check for",
        "What to avoid",
        "Related standards"
      ]
    }
  },
  {
    "slug": "/quality-of-life/target-areas",
    "title": "Are target areas large enough?",
    "description": "",
    "content": "## What this means\n\nInteractive targets must be large enough to be easily activated. This includes buttons, links, form controls, and other clickable or tappable elements.\n\nTargets should provide sufficient size and spacing so users can activate them without precision or accidental activation of adjacent elements.\n\n## Why this matters\n\nUsers with motor impairments may have limited fine motor control. Small or tightly spaced targets increase errors and make interaction frustrating.\n\nAdequate target size also supports users on touch devices, users with tremors, and users in motion. Larger targets improve accuracy and ease of use for everyone.\n\n## What to check for\n\n* Interactive targets meet minimum size requirements.\n* Sufficient spacing exists between adjacent targets.\n* Targets remain usable at different zoom levels.\n* Custom controls provide the same target size as native controls.\n* Assistive technologies can activate targets reliably.\n\n## What to avoid\n\n* Very small clickable or tappable areas.\n* Placing interactive elements too close together.\n* Reducing target size for visual or layout reasons.\n* Relying on precise pointer movement to activate controls.\n\n## Related standards\n\n* WCAG 2.2 Success Criterion 2.5.8 Target Size (Minimum)\n* EN 301 549 clause 9.2.5.8 Target Size (Minimum)\n",
    "_searchMeta": {
      "cleanContent": "what this means interactive targets must be large enough to be easily activated this includes buttons links form controls and other clickable or tappable elements targets should provide sufficient size and spacing so users can activate them without precision or accidental activation of adjacent elements why this matters users with motor impairments may have limited fine motor control small or tightly spaced targets increase errors and make interaction frustrating adequate target size also supports users on touch devices users with tremors and users in motion larger targets improve accuracy and ease of use for everyone what to check for interactive targets meet minimum size requirements sufficient spacing exists between adjacent targets targets remain usable at different zoom levels custom controls provide the same target size as native controls assistive technologies can activate targets reliably what to avoid very small clickable or tappable areas placing interactive elements too close together reducing target size for visual or layout reasons relying on precise pointer movement to activate controls related standards wcag 2 2 success criterion 2 5 8 target size minimum en 301 549 clause 9 2 5 8 target size minimum",
      "headings": [
        "What this means",
        "Why this matters",
        "What to check for",
        "What to avoid",
        "Related standards"
      ],
      "keywords": [
        "target size",
        "pointer input",
        "touch targets",
        "What this means",
        "Why this matters",
        "What to check for",
        "What to avoid",
        "Related standards"
      ]
    }
  },
  {
    "slug": "/quality-of-life/transcript",
    "title": "Does pre-recorded audio-only and video-only content have a transcript?",
    "description": "",
    "content": "## What this means\n\nPre-recorded audio-only and video-only content must have a text transcript. The transcript provides all meaningful information conveyed through audio or visuals in text form.\n\nFor audio-only content, the transcript includes spoken dialogue and relevant sounds. For video-only content, it includes descriptions of visual information needed to understand the content.\n\n## Why this matters\n\nDeaf and hard of hearing users rely on transcripts to access audio-only content. Blind and low vision users rely on transcripts to access video-only content.\n\nTranscripts also support users with cognitive disabilities, users who cannot play media, and users who prefer reading. Text alternatives ensure information is accessible in different contexts and environments.\n\n## What to check for\n\n* Audio-only content includes a complete text transcript.\n* Video-only content includes a transcript describing visual information.\n* Transcripts convey the same meaning as the original media.\n* Transcripts are easy to locate and access.\n* Assistive technologies can read the transcript content.\n\n## What to avoid\n\n* Providing media without any text alternative.\n* Omitting meaningful sounds or visual details from transcripts.\n* Relying on captions for audio-only content.\n* Placing transcripts in formats that are not accessible.\n\n## Related standards\n\n* WCAG 2.2 Success Criterion 1.2.1 Audio-only and Video-only (Prerecorded)\n* EN 301 549 clause 9.1.2.1 Audio-only and Video-only (Prerecorded)\n",
    "_searchMeta": {
      "cleanContent": "what this means pre-recorded audio-only and video-only content must have a text transcript the transcript provides all meaningful information conveyed through audio or visuals in text form for audio-only content the transcript includes spoken dialogue and relevant sounds for video-only content it includes descriptions of visual information needed to understand the content why this matters deaf and hard of hearing users rely on transcripts to access audio-only content blind and low vision users rely on transcripts to access video-only content transcripts also support users with cognitive disabilities users who cannot play media and users who prefer reading text alternatives ensure information is accessible in different contexts and environments what to check for audio-only content includes a complete text transcript video-only content includes a transcript describing visual information transcripts convey the same meaning as the original media transcripts are easy to locate and access assistive technologies can read the transcript content what to avoid providing media without any text alternative omitting meaningful sounds or visual details from transcripts relying on captions for audio-only content placing transcripts in formats that are not accessible related standards wcag 2 2 success criterion 1 2 1 audio-only and video-only prerecorded en 301 549 clause 9 1 2 1 audio-only and video-only prerecorded",
      "headings": [
        "What this means",
        "Why this matters",
        "What to check for",
        "What to avoid",
        "Related standards"
      ],
      "keywords": [
        "transcripts",
        "audio-only",
        "video-only",
        "What this means",
        "Why this matters",
        "What to check for",
        "What to avoid",
        "Related standards"
      ]
    }
  },
  {
    "slug": "/quality-of-life/video-captions",
    "title": "Do pre-recorded videos have captions?",
    "description": "",
    "content": "## What this means\n\nPre-recorded videos that contain audio must include captions. Captions provide a text version of spoken dialogue and other meaningful audio information.\n\nCaptions must be synchronized with the video and available whenever the video is played.\n\n## Why this matters\n\nDeaf and hard of hearing users rely on captions to access audio content. Without captions, spoken information and context may be completely unavailable.\n\nCaptions also support users in noisy or quiet environments, users with cognitive disabilities, and users who cannot play audio. They improve comprehension and flexibility for all users.\n\n## What to check for\n\n* All pre-recorded videos with audio include captions.\n* Captions accurately reflect spoken dialogue and relevant sounds.\n* Captions are synchronized with the video playback.\n* Captions are readable and not obscured by other content.\n* Users can enable captions when the video is played.\n\n## What to avoid\n\n* Publishing videos with audio and no captions.\n* Using auto-generated captions without review.\n* Omitting non-speech audio that conveys meaning.\n* Providing captions that are out of sync or incomplete.\n\n## Related standards\n\n* WCAG 2.2 Success Criterion 1.2.2 Captions (Prerecorded)\n* EN 301 549 clause 9.1.2.2 Captions (Prerecorded)\n",
    "_searchMeta": {
      "cleanContent": "what this means pre-recorded videos that contain audio must include captions captions provide a text version of spoken dialogue and other meaningful audio information captions must be synchronized with the video and available whenever the video is played why this matters deaf and hard of hearing users rely on captions to access audio content without captions spoken information and context may be completely unavailable captions also support users in noisy or quiet environments users with cognitive disabilities and users who cannot play audio they improve comprehension and flexibility for all users what to check for all pre-recorded videos with audio include captions captions accurately reflect spoken dialogue and relevant sounds captions are synchronized with the video playback captions are readable and not obscured by other content users can enable captions when the video is played what to avoid publishing videos with audio and no captions using auto-generated captions without review omitting non-speech audio that conveys meaning providing captions that are out of sync or incomplete related standards wcag 2 2 success criterion 1 2 2 captions prerecorded en 301 549 clause 9 1 2 2 captions prerecorded",
      "headings": [
        "What this means",
        "Why this matters",
        "What to check for",
        "What to avoid",
        "Related standards"
      ],
      "keywords": [
        "captions",
        "video",
        "pre-recorded media",
        "What this means",
        "Why this matters",
        "What to check for",
        "What to avoid",
        "Related standards"
      ]
    }
  },
  {
    "slug": "/readability/color-contrast",
    "title": "Does text have sufficient color contrast with the background?",
    "description": "",
    "content": "## What this means\n\nText must have enough contrast against its background to be readable. Contrast is determined by the luminance difference between the text color and the background color.\n\nMinimum contrast ratios apply to most text. Larger text and non-essential decorative text may have different requirements.\n\n## Why this matters\n\nUsers with low vision or color vision deficiencies may not be able to read low-contrast text. Poor contrast also affects users in bright environments or on low-quality displays.\n\nSufficient contrast improves readability for all users. It reduces eye strain and supports comprehension across a wide range of viewing conditions.\n\n## What to check for\n\n* Text meets minimum contrast ratios against its background.\n* Contrast is maintained across all states, including hover and focus.\n* Text remains readable in high contrast and forced color modes.\n* Background images do not reduce text readability.\n* Icons that convey meaning meet contrast requirements.\n\n## What to avoid\n\n* Using low-contrast color combinations.\n* Relying on color alone to convey information.\n* Placing text over images without ensuring sufficient contrast.\n* Reducing contrast for disabled or secondary text.\n\n## Related standards\n\n* WCAG 2.2 Success Criterion 1.4.3 Contrast (Minimum)\n* WCAG 2.2 Success Criterion 1.4.11 Non-text Contrast\n* EN 301 549 clause 9.1.4.3 Contrast (Minimum)\n* EN 301 549 clause 9.1.4.11 Non-text Contrast\n",
    "_searchMeta": {
      "cleanContent": "what this means text must have enough contrast against its background to be readable contrast is determined by the luminance difference between the text color and the background color minimum contrast ratios apply to most text larger text and non-essential decorative text may have different requirements why this matters users with low vision or color vision deficiencies may not be able to read low-contrast text poor contrast also affects users in bright environments or on low-quality displays sufficient contrast improves readability for all users it reduces eye strain and supports comprehension across a wide range of viewing conditions what to check for text meets minimum contrast ratios against its background contrast is maintained across all states including hover and focus text remains readable in high contrast and forced color modes background images do not reduce text readability icons that convey meaning meet contrast requirements what to avoid using low-contrast color combinations relying on color alone to convey information placing text over images without ensuring sufficient contrast reducing contrast for disabled or secondary text related standards wcag 2 2 success criterion 1 4 3 contrast minimum wcag 2 2 success criterion 1 4 11 non-text contrast en 301 549 clause 9 1 4 3 contrast minimum en 301 549 clause 9 1 4 11 non-text contrast",
      "headings": [
        "What this means",
        "Why this matters",
        "What to check for",
        "What to avoid",
        "Related standards"
      ],
      "keywords": [
        "color contrast",
        "text readability",
        "visual presentation",
        "What this means",
        "Why this matters",
        "What to check for",
        "What to avoid",
        "Related standards"
      ]
    }
  },
  {
    "slug": "/readability/horizontal-scroll",
    "title": "Does content require users to scroll both vertically and horizontally?",
    "description": "",
    "content": "## What this means\n\nContent should not require users to scroll in two directions to read or interact with it. Users should be able to scroll in a single direction, typically vertically, at common viewport sizes.\n\nHorizontal scrolling may be acceptable for specific components such as data tables or images when it is essential to the content. It should not be required for general reading or primary interactions.\n\n## Why this matters\n\nUsers with low vision often zoom content to read it. When layouts force both horizontal and vertical scrolling, navigation becomes slow and disorienting.\n\nKeyboard and screen reader users are also affected. Two-dimensional scrolling increases effort and can make it harder to understand content order and context.\n\n## What to check for\n\n* Content reflows to fit the viewport when zoomed.\n* Horizontal scrolling is not required for body text or core interactions.\n* Layouts adapt at smaller widths without truncation.\n* Components that require horizontal scrolling are limited and intentional.\n* Reading order remains logical when content reflows.\n\n## What to avoid\n\n* Fixed-width layouts that cause horizontal scrolling.\n* Preventing content from wrapping when zoomed.\n* Requiring horizontal scrolling for paragraphs or forms.\n* Hiding content off screen without a clear way to access it.\n\n## Related standards\n\n* WCAG 2.2 Success Criterion 1.4.10 Reflow\n* WCAG 2.2 Success Criterion 1.4.4 Resize Text\n* EN 301 549 clause 9.1.4.10 Reflow\n* EN 301 549 clause 9.1.4.4 Resize Text\n",
    "_searchMeta": {
      "cleanContent": "what this means content should not require users to scroll in two directions to read or interact with it users should be able to scroll in a single direction typically vertically at common viewport sizes horizontal scrolling may be acceptable for specific components such as data tables or images when it is essential to the content it should not be required for general reading or primary interactions why this matters users with low vision often zoom content to read it when layouts force both horizontal and vertical scrolling navigation becomes slow and disorienting keyboard and screen reader users are also affected two-dimensional scrolling increases effort and can make it harder to understand content order and context what to check for content reflows to fit the viewport when zoomed horizontal scrolling is not required for body text or core interactions layouts adapt at smaller widths without truncation components that require horizontal scrolling are limited and intentional reading order remains logical when content reflows what to avoid fixed-width layouts that cause horizontal scrolling preventing content from wrapping when zoomed requiring horizontal scrolling for paragraphs or forms hiding content off screen without a clear way to access it related standards wcag 2 2 success criterion 1 4 10 reflow wcag 2 2 success criterion 1 4 4 resize text en 301 549 clause 9 1 4 10 reflow en 301 549 clause 9 1 4 4 resize text",
      "headings": [
        "What this means",
        "Why this matters",
        "What to check for",
        "What to avoid",
        "Related standards"
      ],
      "keywords": [
        "reflow",
        "scrolling",
        "responsive layout",
        "What this means",
        "Why this matters",
        "What to check for",
        "What to avoid",
        "Related standards"
      ]
    }
  },
  {
    "slug": "/readability",
    "title": "Readability",
    "description": "Heuristics for easy to read and comprehend content",
    "content": "# Readability\n\nThis category covers heuristics that ensure text content is easy to read and understand for all users.\n\n## Why this matters\n\nReadable content:\n\n* Serves users with low vision, dyslexia, or cognitive disabilities\n* Reduces eye strain for all users\n* Improves comprehension and retention\n* Works better on different devices and screen sizes\n* Makes content accessible in various lighting conditions\n\nGood readability is essential for effective communication.\n\n## Heuristics in this category\n\nThis category contains 6 heuristics covering text presentation and readability.\n",
    "_searchMeta": {
      "cleanContent": "readability this category covers heuristics that ensure text content is easy to read and understand for all users why this matters readable content: serves users with low vision dyslexia or cognitive disabilities reduces eye strain for all users improves comprehension and retention works better on different devices and screen sizes makes content accessible in various lighting conditions good readability is essential for effective communication heuristics in this category this category contains 6 heuristics covering text presentation and readability",
      "headings": ["Why this matters", "Heuristics in this category"],
      "keywords": [
        "readability",
        "typography",
        "text",
        "legibility",
        "comprehension",
        "Why this matters",
        "Heuristics in this category"
      ]
    }
  },
  {
    "slug": "/readability/informative-images",
    "title": "Do informative images and complex graphs and charts have a meaningful accessible name?",
    "description": "",
    "content": "## What this means\n\nInformative images, charts, and graphs must have an accessible name that clearly describes their purpose or content. The accessible name must convey the same meaningful information that is available visually.\n\nFor complex visuals, the accessible name may provide a concise summary, with additional text elsewhere to convey full details when needed.\n\n## Why this matters\n\nScreen reader users cannot perceive visual content without text alternatives. Without a meaningful accessible name, important information may be missing or unclear.\n\nUsers with low vision or who disable images also rely on accessible names to understand visual content. Clear descriptions ensure information is available regardless of how content is perceived.\n\n## What to check for\n\n* Informative images have an appropriate accessible name.\n* Charts and graphs include a summary that explains their purpose or key insight.\n* Accessible names are accurate, concise, and meaningful.\n* Decorative images are not given informative names.\n* Assistive technologies announce the accessible name correctly.\n\n## What to avoid\n\n* Leaving informative images without an accessible name.\n* Using file names or generic text as descriptions.\n* Overloading accessible names with excessive detail.\n* Relying on surrounding visual context alone to explain images.\n\n## Related standards\n\n* WCAG 2.2 Success Criterion 1.1.1 Non-text Content\n* WCAG 2.2 Success Criterion 1.3.1 Info and Relationships\n* EN 301 549 clause 9.1.1.1 Non-text Content\n* EN 301 549 clause 9.1.3.1 Info and Relationships\n",
    "_searchMeta": {
      "cleanContent": "what this means informative images charts and graphs must have an accessible name that clearly describes their purpose or content the accessible name must convey the same meaningful information that is available visually for complex visuals the accessible name may provide a concise summary with additional text elsewhere to convey full details when needed why this matters screen reader users cannot perceive visual content without text alternatives without a meaningful accessible name important information may be missing or unclear users with low vision or who disable images also rely on accessible names to understand visual content clear descriptions ensure information is available regardless of how content is perceived what to check for informative images have an appropriate accessible name charts and graphs include a summary that explains their purpose or key insight accessible names are accurate concise and meaningful decorative images are not given informative names assistive technologies announce the accessible name correctly what to avoid leaving informative images without an accessible name using file names or generic text as descriptions overloading accessible names with excessive detail relying on surrounding visual context alone to explain images related standards wcag 2 2 success criterion 1 1 1 non-text content wcag 2 2 success criterion 1 3 1 info and relationships en 301 549 clause 9 1 1 1 non-text content en 301 549 clause 9 1 3 1 info and relationships",
      "headings": [
        "What this means",
        "Why this matters",
        "What to check for",
        "What to avoid",
        "Related standards"
      ],
      "keywords": [
        "informative images",
        "accessible names",
        "charts and graphs",
        "What this means",
        "Why this matters",
        "What to check for",
        "What to avoid",
        "Related standards"
      ]
    }
  },
  {
    "slug": "/readability/link-visibility",
    "title": "Do links without an underline have an additional visual cue to identify them as links?",
    "description": "",
    "content": "## What this means\n\nWhen links are not underlined, they must include another clear visual cue that identifies them as links. Users should be able to recognize links without interacting with them.\n\nVisual cues may include styling such as color contrast, icons, font treatment, or other consistent indicators. These cues must be perceivable without relying on color alone.\n\n## Why this matters\n\nUsers rely on visual affordances to identify interactive elements. If links are not clearly distinguishable from surrounding text, users may miss navigation options or misunderstand content.\n\nClear link identification also supports users with cognitive disabilities and low vision. Predictable visual patterns improve scanning and reduce uncertainty.\n\n## What to check for\n\n* Links without underlines have a consistent visual indicator.\n* The indicator is perceivable without relying on color alone.\n* Link styling is distinct from surrounding body text.\n* Hover and focus states reinforce link affordance.\n* Visual cues are consistent across the interface.\n\n## What to avoid\n\n* Removing underlines without providing another cue.\n* Relying on color differences alone to indicate links.\n* Using link styling that closely matches body text.\n* Introducing inconsistent link treatments across pages.\n\n## Related standards\n\n* WCAG 2.2 Success Criterion 1.4.1 Use of Color\n* WCAG 2.2 Success Criterion 1.3.1 Info and Relationships\n* EN 301 549 clause 9.1.4.1 Use of Color\n* EN 301 549 clause 9.1.3.1 Info and Relationships\n",
    "_searchMeta": {
      "cleanContent": "what this means when links are not underlined they must include another clear visual cue that identifies them as links users should be able to recognize links without interacting with them visual cues may include styling such as color contrast icons font treatment or other consistent indicators these cues must be perceivable without relying on color alone why this matters users rely on visual affordances to identify interactive elements if links are not clearly distinguishable from surrounding text users may miss navigation options or misunderstand content clear link identification also supports users with cognitive disabilities and low vision predictable visual patterns improve scanning and reduce uncertainty what to check for links without underlines have a consistent visual indicator the indicator is perceivable without relying on color alone link styling is distinct from surrounding body text hover and focus states reinforce link affordance visual cues are consistent across the interface what to avoid removing underlines without providing another cue relying on color differences alone to indicate links using link styling that closely matches body text introducing inconsistent link treatments across pages related standards wcag 2 2 success criterion 1 4 1 use of color wcag 2 2 success criterion 1 3 1 info and relationships en 301 549 clause 9 1 4 1 use of color en 301 549 clause 9 1 3 1 info and relationships",
      "headings": [
        "What this means",
        "Why this matters",
        "What to check for",
        "What to avoid",
        "Related standards"
      ],
      "keywords": [
        "links",
        "visual cues",
        "discoverability",
        "What this means",
        "Why this matters",
        "What to check for",
        "What to avoid",
        "Related standards"
      ]
    }
  },
  {
    "slug": "/readability/padding-spacing",
    "title": "Can users adjust padding and line spacing without loss of content or functionality?",
    "description": "",
    "content": "## What this means\n\nUsers must be able to adjust text spacing without content being hidden, overlapped, or made unusable. This includes line height, paragraph spacing, letter spacing, word spacing, and padding around text.\n\nContent and functionality must remain intact when users apply custom styles through browser settings, extensions, or user stylesheets.\n\n## Why this matters\n\nUsers with low vision, dyslexia, or cognitive disabilities often adjust spacing to improve readability. If layouts break when spacing changes, content can become difficult or impossible to use.\n\nScreen reader and keyboard users may also be affected when spacing changes disrupt focus order, visibility, or interactive controls.\n\n## What to check for\n\n* Content remains readable when line height is increased.\n* Text does not overlap or clip when spacing is adjusted.\n* Interactive elements remain usable with increased padding.\n* Containers expand to accommodate increased spacing.\n* No content or functionality is lost when custom spacing is applied.\n\n## What to avoid\n\n* Fixed heights that clip text when spacing changes.\n* Absolute positioning that causes overlap.\n* Preventing users from applying custom styles.\n* Hiding overflow that conceals expanded content.\n\n## Related standards\n\n* WCAG 2.2 Success Criterion 1.4.12 Text Spacing\n* EN 301 549 clause 9.1.4.12 Text Spacing\n",
    "_searchMeta": {
      "cleanContent": "what this means users must be able to adjust text spacing without content being hidden overlapped or made unusable this includes line height paragraph spacing letter spacing word spacing and padding around text content and functionality must remain intact when users apply custom styles through browser settings extensions or user stylesheets why this matters users with low vision dyslexia or cognitive disabilities often adjust spacing to improve readability if layouts break when spacing changes content can become difficult or impossible to use screen reader and keyboard users may also be affected when spacing changes disrupt focus order visibility or interactive controls what to check for content remains readable when line height is increased text does not overlap or clip when spacing is adjusted interactive elements remain usable with increased padding containers expand to accommodate increased spacing no content or functionality is lost when custom spacing is applied what to avoid fixed heights that clip text when spacing changes absolute positioning that causes overlap preventing users from applying custom styles hiding overflow that conceals expanded content related standards wcag 2 2 success criterion 1 4 12 text spacing en 301 549 clause 9 1 4 12 text spacing",
      "headings": [
        "What this means",
        "Why this matters",
        "What to check for",
        "What to avoid",
        "Related standards"
      ],
      "keywords": [
        "text spacing",
        "readability",
        "custom styles",
        "What this means",
        "Why this matters",
        "What to check for",
        "What to avoid",
        "Related standards"
      ]
    }
  },
  {
    "slug": "/readability/use-of-color",
    "title": "Is meaning that is conveyed through color also presented in a way that does not depend on color?",
    "description": "",
    "content": "## What this means\n\nInformation, status, or instructions must not rely on color alone to be understood. Any meaning conveyed through color must also be available through text, icons, patterns, or programmatic cues.\n\nUsers should be able to perceive the same information regardless of their ability to distinguish colors.\n\n## Why this matters\n\nUsers with color vision deficiencies may not perceive differences in color. If color is the only indicator, critical information can be missed.\n\nScreen reader users and users of high contrast or forced color modes may not perceive color styling at all. Redundant cues ensure information is consistently available.\n\n## What to check for\n\n* Color-coded information is also conveyed through text or symbols.\n* Required fields, errors, and statuses have non-color indicators.\n* Charts and graphs include labels or patterns in addition to color.\n* Links are distinguishable without relying on color alone.\n* Assistive technologies can access the same meaning programmatically.\n\n## What to avoid\n\n* Using color as the only way to indicate errors, success, or selection.\n* Relying on color differences without additional cues.\n* Removing text or icons once color is applied.\n* Assuming all users can perceive or interpret color correctly.\n\n## Related standards\n\n* WCAG 2.2 Success Criterion 1.4.1 Use of Color\n* EN 301 549 clause 9.1.4.1 Use of Color\n",
    "_searchMeta": {
      "cleanContent": "what this means information status or instructions must not rely on color alone to be understood any meaning conveyed through color must also be available through text icons patterns or programmatic cues users should be able to perceive the same information regardless of their ability to distinguish colors why this matters users with color vision deficiencies may not perceive differences in color if color is the only indicator critical information can be missed screen reader users and users of high contrast or forced color modes may not perceive color styling at all redundant cues ensure information is consistently available what to check for color-coded information is also conveyed through text or symbols required fields errors and statuses have non-color indicators charts and graphs include labels or patterns in addition to color links are distinguishable without relying on color alone assistive technologies can access the same meaning programmatically what to avoid using color as the only way to indicate errors success or selection relying on color differences without additional cues removing text or icons once color is applied assuming all users can perceive or interpret color correctly related standards wcag 2 2 success criterion 1 4 1 use of color en 301 549 clause 9 1 4 1 use of color",
      "headings": [
        "What this means",
        "Why this matters",
        "What to check for",
        "What to avoid",
        "Related standards"
      ],
      "keywords": [
        "use of color",
        "non-color indicators",
        "visual cues",
        "What this means",
        "Why this matters",
        "What to check for",
        "What to avoid",
        "Related standards"
      ]
    }
  },
  {
    "slug": "/screen-reader-support/active-images",
    "title": "Do active images have a meaningful accessible name?",
    "description": "",
    "content": "## What this means\n\nImages that function as interactive controls must have a meaningful accessible name. The name must describe the action or destination triggered by the image.\n\nActive images include images used as links, buttons, or other interactive elements. Decorative images are excluded when they do not provide information or functionality.\n\n## Why this matters\n\nScreen reader users rely on accessible names to understand what an interactive element does. Without a meaningful name, an active image may be announced without context or purpose.\n\nKeyboard users and users of voice control also depend on clear names to identify and activate controls. Meaningful names make interaction predictable and efficient.\n\n## What to check for\n\n* Active images have an accessible name that describes their action or destination.\n* The accessible name matches the visible intent of the image.\n* Images used as links or buttons are announced with the correct role.\n* Accessible names are provided through appropriate markup.\n* Assistive technologies announce a clear and specific control name.\n\n## What to avoid\n\n* Leaving active images without an accessible name.\n* Using file names or generic text for interactive images.\n* Assigning decorative images an interactive name.\n* Relying on surrounding visual context to explain the action.\n\n## Related standards\n\n* WCAG 2.2 Success Criterion 1.1.1 Non-text Content\n* WCAG 2.2 Success Criterion 4.1.2 Name, Role, Value\n* EN 301 549 clause 9.1.1.1 Non-text Content\n* EN 301 549 clause 9.4.1.2 Name, Role, Value\n",
    "_searchMeta": {
      "cleanContent": "what this means images that function as interactive controls must have a meaningful accessible name the name must describe the action or destination triggered by the image active images include images used as links buttons or other interactive elements decorative images are excluded when they do not provide information or functionality why this matters screen reader users rely on accessible names to understand what an interactive element does without a meaningful name an active image may be announced without context or purpose keyboard users and users of voice control also depend on clear names to identify and activate controls meaningful names make interaction predictable and efficient what to check for active images have an accessible name that describes their action or destination the accessible name matches the visible intent of the image images used as links or buttons are announced with the correct role accessible names are provided through appropriate markup assistive technologies announce a clear and specific control name what to avoid leaving active images without an accessible name using file names or generic text for interactive images assigning decorative images an interactive name relying on surrounding visual context to explain the action related standards wcag 2 2 success criterion 1 1 1 non-text content wcag 2 2 success criterion 4 1 2 name role value en 301 549 clause 9 1 1 1 non-text content en 301 549 clause 9 4 1 2 name role value",
      "headings": [
        "What this means",
        "Why this matters",
        "What to check for",
        "What to avoid",
        "Related standards"
      ],
      "keywords": [
        "active images",
        "accessible names",
        "interactive content",
        "What this means",
        "Why this matters",
        "What to check for",
        "What to avoid",
        "Related standards"
      ]
    }
  },
  {
    "slug": "/screen-reader-support/decorative-images",
    "title": "Are decorative images identified and marked in a way that they can be ignored by assistive technologies?",
    "description": "",
    "content": "## What this means\n\nImages that do not convey information or provide functionality must be identified as decorative. Decorative images should be hidden from assistive technologies so they are not announced to users.\n\nMarking images as decorative ensures that only meaningful content is exposed through accessibility APIs. This is typically done through empty alternative text or appropriate role usage.\n\n## Why this matters\n\nScreen reader users depend on concise and relevant output. Announcing decorative images adds noise and makes it harder to understand important content.\n\nIgnoring decorative images also improves efficiency for keyboard and assistive technology users. It reduces unnecessary stops and supports clearer navigation.\n\n## What to check for\n\n* Decorative images are marked so they are ignored by assistive technologies.\n* Informative images are not incorrectly marked as decorative.\n* Empty alternative text is used correctly for decorative images.\n* Decorative background images do not contain meaningful information.\n* Assistive technologies do not announce decorative visuals.\n\n## What to avoid\n\n* Providing descriptive alternative text for decorative images.\n* Leaving decorative images without explicit markup.\n* Using decorative images to convey important information.\n* Hiding informative images from assistive technologies.\n\n## Related standards\n\n* WCAG 2.2 Success Criterion 1.1.1 Non-text Content\n* EN 301 549 clause 9.1.1.1 Non-text Content\n",
    "_searchMeta": {
      "cleanContent": "what this means images that do not convey information or provide functionality must be identified as decorative decorative images should be hidden from assistive technologies so they are not announced to users marking images as decorative ensures that only meaningful content is exposed through accessibility apis this is typically done through empty alternative text or appropriate role usage why this matters screen reader users depend on concise and relevant output announcing decorative images adds noise and makes it harder to understand important content ignoring decorative images also improves efficiency for keyboard and assistive technology users it reduces unnecessary stops and supports clearer navigation what to check for decorative images are marked so they are ignored by assistive technologies informative images are not incorrectly marked as decorative empty alternative text is used correctly for decorative images decorative background images do not contain meaningful information assistive technologies do not announce decorative visuals what to avoid providing descriptive alternative text for decorative images leaving decorative images without explicit markup using decorative images to convey important information hiding informative images from assistive technologies related standards wcag 2 2 success criterion 1 1 1 non-text content en 301 549 clause 9 1 1 1 non-text content",
      "headings": [
        "What this means",
        "Why this matters",
        "What to check for",
        "What to avoid",
        "Related standards"
      ],
      "keywords": [
        "decorative images",
        "non-text content",
        "assistive technologies",
        "What this means",
        "Why this matters",
        "What to check for",
        "What to avoid",
        "Related standards"
      ]
    }
  },
  {
    "slug": "/screen-reader-support/form-errors",
    "title": "Are form errors identified in a way that does not rely on sight?",
    "description": "",
    "content": "## What this means\n\nForm errors must be identified in a way that does not depend on visual cues. Users must be able to perceive and understand errors through text and programmatic information.\n\nError identification should clearly indicate which field is affected and why. This information must be available to assistive technologies.\n\n## Why this matters\n\nScreen reader users cannot perceive visual indicators such as color, icons, or positioning. If errors rely on sight alone, they may go unnoticed or be unclear.\n\nKeyboard users and users with cognitive disabilities also benefit from clear, non-visual error identification. Explicit messages reduce confusion and support efficient error recovery.\n\n## What to check for\n\n* Errors are identified using text that describes the problem.\n* Error messages are programmatically associated with the relevant fields.\n* Errors are announced by assistive technologies when they occur.\n* Color is not the only means used to indicate an error.\n* Users can locate and understand errors without visual context.\n\n## What to avoid\n\n* Indicating errors only with color, icons, or visual placement.\n* Displaying error states without descriptive text.\n* Failing to associate error messages with form controls.\n* Requiring users to infer errors from layout or styling changes.\n\n## Related standards\n\n* WCAG 2.2 Success Criterion 3.3.1 Error Identification\n* WCAG 2.2 Success Criterion 1.3.1 Info and Relationships\n* WCAG 2.2 Success Criterion 4.1.3 Status Messages\n* EN 301 549 clause 9.3.3.1 Error Identification\n* EN 301 549 clause 9.1.3.1 Info and Relationships\n* EN 301 549 clause 9.4.1.3 Status Messages\n",
    "_searchMeta": {
      "cleanContent": "what this means form errors must be identified in a way that does not depend on visual cues users must be able to perceive and understand errors through text and programmatic information error identification should clearly indicate which field is affected and why this information must be available to assistive technologies why this matters screen reader users cannot perceive visual indicators such as color icons or positioning if errors rely on sight alone they may go unnoticed or be unclear keyboard users and users with cognitive disabilities also benefit from clear non-visual error identification explicit messages reduce confusion and support efficient error recovery what to check for errors are identified using text that describes the problem error messages are programmatically associated with the relevant fields errors are announced by assistive technologies when they occur color is not the only means used to indicate an error users can locate and understand errors without visual context what to avoid indicating errors only with color icons or visual placement displaying error states without descriptive text failing to associate error messages with form controls requiring users to infer errors from layout or styling changes related standards wcag 2 2 success criterion 3 3 1 error identification wcag 2 2 success criterion 1 3 1 info and relationships wcag 2 2 success criterion 4 1 3 status messages en 301 549 clause 9 3 3 1 error identification en 301 549 clause 9 1 3 1 info and relationships en 301 549 clause 9 4 1 3 status messages",
      "headings": [
        "What this means",
        "Why this matters",
        "What to check for",
        "What to avoid",
        "Related standards"
      ],
      "keywords": [
        "form errors",
        "error identification",
        "non-visual feedback",
        "What this means",
        "Why this matters",
        "What to check for",
        "What to avoid",
        "Related standards"
      ]
    }
  },
  {
    "slug": "/screen-reader-support",
    "title": "Screen Reader Support",
    "description": "Heuristics for optimizing content for assistive technologies",
    "content": "# Screen Reader Support\n\nThis category covers heuristics that ensure content works effectively with screen readers and other assistive technologies.\n\n## Why this matters\n\nScreen reader support:\n\n* Enables blind and low-vision users to access your content\n* Ensures information is conveyed programmatically, not just visually\n* Provides context and status updates that sighted users get automatically\n* Makes complex interactions understandable through audio\n* Demonstrates commitment to inclusive design\n\nScreen readers translate visual interfaces into audio, and proper support makes this translation accurate and efficient.\n\n## Heuristics in this category\n\nThis category contains 7 heuristics covering screen reader optimization and assistive technology support.\n",
    "_searchMeta": {
      "cleanContent": "screen reader support this category covers heuristics that ensure content works effectively with screen readers and other assistive technologies why this matters screen reader support: enables blind and low-vision users to access your content ensures information is conveyed programmatically not just visually provides context and status updates that sighted users get automatically makes complex interactions understandable through audio demonstrates commitment to inclusive design screen readers translate visual interfaces into audio and proper support makes this translation accurate and efficient heuristics in this category this category contains 7 heuristics covering screen reader optimization and assistive technology support",
      "headings": ["Why this matters", "Heuristics in this category"],
      "keywords": [
        "screen reader",
        "assistive technology",
        "ARIA",
        "announcements",
        "AT",
        "Why this matters",
        "Heuristics in this category"
      ]
    }
  },
  {
    "slug": "/screen-reader-support/language",
    "title": "Are the main page language and language changes correctly designated for assistive technologies?",
    "description": "",
    "content": "## What this means\n\nEach page must declare a primary language that applies to the overall content. Any changes in language within the page must also be identified programmatically.\n\nLanguage is designated using appropriate markup so assistive technologies can detect and interpret it correctly.\n\n## Why this matters\n\nScreen reader users rely on language information to apply correct pronunciation and speech rules. When language is not identified or is incorrect, content may be mispronounced or hard to understand.\n\nLanguage designation also supports translation tools and users with cognitive or learning disabilities. Clear language context improves comprehension and reduces confusion.\n\n## What to check for\n\n* The page has a single, correct primary language defined.\n* All language changes within the content are programmatically marked.\n* Language attributes accurately match the written language.\n* Mixed-language content is identified at the correct scope.\n* Assistive technologies announce language changes as expected.\n\n## What to avoid\n\n* Omitting the primary language of the page.\n* Using an incorrect or overly generic language code.\n* Failing to mark inline language changes.\n* Applying language attributes inconsistently or unnecessarily.\n\n## Related standards\n\n* WCAG 2.2 Success Criterion 3.1.1 Language of Page\n* WCAG 2.2 Success Criterion 3.1.2 Language of Parts\n* EN 301 549 clause 9.3.1.1 Language of Page\n* EN 301 549 clause 9.3.1.2 Language of Parts\n",
    "_searchMeta": {
      "cleanContent": "what this means each page must declare a primary language that applies to the overall content any changes in language within the page must also be identified programmatically language is designated using appropriate markup so assistive technologies can detect and interpret it correctly why this matters screen reader users rely on language information to apply correct pronunciation and speech rules when language is not identified or is incorrect content may be mispronounced or hard to understand language designation also supports translation tools and users with cognitive or learning disabilities clear language context improves comprehension and reduces confusion what to check for the page has a single correct primary language defined all language changes within the content are programmatically marked language attributes accurately match the written language mixed-language content is identified at the correct scope assistive technologies announce language changes as expected what to avoid omitting the primary language of the page using an incorrect or overly generic language code failing to mark inline language changes applying language attributes inconsistently or unnecessarily related standards wcag 2 2 success criterion 3 1 1 language of page wcag 2 2 success criterion 3 1 2 language of parts en 301 549 clause 9 3 1 1 language of page en 301 549 clause 9 3 1 2 language of parts",
      "headings": [
        "What this means",
        "Why this matters",
        "What to check for",
        "What to avoid",
        "Related standards"
      ],
      "keywords": [
        "language",
        "language changes",
        "assistive technologies",
        "What this means",
        "Why this matters",
        "What to check for",
        "What to avoid",
        "Related standards"
      ]
    }
  },
  {
    "slug": "/screen-reader-support/status-messages",
    "title": "Are dynamically updated status messages announced without receiving visual focus?",
    "description": "",
    "content": "## What this means\n\nStatus messages that update dynamically must be announced to assistive technologies without moving visual focus. Users should receive important feedback without their current task being interrupted.\n\nStatus messages include confirmations, errors, progress updates, and other changes that are not the result of direct focus movement.\n\n## Why this matters\n\nScreen reader users may not be aware of dynamic changes if they are not announced programmatically. Moving focus to announce a message can also be disruptive and confusing.\n\nAnnouncing status messages without shifting focus supports keyboard users and users with cognitive disabilities. It allows users to stay oriented while still receiving timely feedback.\n\n## What to check for\n\n* Status messages are programmatically exposed to assistive technologies.\n* Messages are announced without moving visual focus.\n* Appropriate roles or properties are used for live updates.\n* Announcements are concise and relevant to the user’s action.\n* Repeated or unnecessary announcements are avoided.\n\n## What to avoid\n\n* Requiring focus to move in order to announce a status message.\n* Displaying visual-only updates with no programmatic announcement.\n* Announcing non-essential changes that interrupt the user.\n* Using incorrect roles that cause unexpected focus behavior.\n\n## Related standards\n\n* WCAG 2.2 Success Criterion 4.1.3 Status Messages\n* EN 301 549 clause 9.4.1.3 Status Messages\n",
    "_searchMeta": {
      "cleanContent": "what this means status messages that update dynamically must be announced to assistive technologies without moving visual focus users should receive important feedback without their current task being interrupted status messages include confirmations errors progress updates and other changes that are not the result of direct focus movement why this matters screen reader users may not be aware of dynamic changes if they are not announced programmatically moving focus to announce a message can also be disruptive and confusing announcing status messages without shifting focus supports keyboard users and users with cognitive disabilities it allows users to stay oriented while still receiving timely feedback what to check for status messages are programmatically exposed to assistive technologies messages are announced without moving visual focus appropriate roles or properties are used for live updates announcements are concise and relevant to the user s action repeated or unnecessary announcements are avoided what to avoid requiring focus to move in order to announce a status message displaying visual-only updates with no programmatic announcement announcing non-essential changes that interrupt the user using incorrect roles that cause unexpected focus behavior related standards wcag 2 2 success criterion 4 1 3 status messages en 301 549 clause 9 4 1 3 status messages",
      "headings": [
        "What this means",
        "Why this matters",
        "What to check for",
        "What to avoid",
        "Related standards"
      ],
      "keywords": [
        "status messages",
        "live regions",
        "dynamic updates",
        "What this means",
        "Why this matters",
        "What to check for",
        "What to avoid",
        "Related standards"
      ]
    }
  },
  {
    "slug": "/screen-reader-support/table-structure",
    "title": "Do data tables have meaningful semantic column and row headers as well as a table name?",
    "description": "",
    "content": "## What this means\n\nData tables must use semantic markup to identify column headers, row headers, and a table name. Headers define how data cells relate to each other, and the table name provides overall context.\n\nThe table name is typically provided with a caption or an accessible name. Header cells are identified programmatically so relationships are exposed to assistive technologies.\n\n## Why this matters\n\nScreen reader users rely on table semantics to understand data relationships. Without headers or a table name, data may be announced without context or meaning.\n\nClear table structure also supports keyboard users and users with cognitive disabilities. It improves orientation, comprehension, and efficient navigation within tables.\n\n## What to check for\n\n* Data tables use semantic table markup.\n* Column headers are marked as headers.\n* Row headers are used where appropriate.\n* The table has a meaningful name or caption.\n* Assistive technologies can announce headers and table context.\n\n## What to avoid\n\n* Using tables for layout instead of data.\n* Presenting data without semantic headers.\n* Omitting a table name or caption.\n* Relying on visual styling alone to indicate headers.\n\n## Related standards\n\n* WCAG 2.2 Success Criterion 1.3.1 Info and Relationships\n* WCAG 2.2 Success Criterion 2.4.6 Headings and Labels\n* WCAG 2.2 Success Criterion 4.1.2 Name, Role, Value\n* EN 301 549 clause 9.1.3.1 Info and Relationships\n* EN 301 549 clause 9.2.4.6 Headings and Labels\n* EN 301 549 clause 9.4.1.2 Name, Role, Value\n",
    "_searchMeta": {
      "cleanContent": "what this means data tables must use semantic markup to identify column headers row headers and a table name headers define how data cells relate to each other and the table name provides overall context the table name is typically provided with a caption or an accessible name header cells are identified programmatically so relationships are exposed to assistive technologies why this matters screen reader users rely on table semantics to understand data relationships without headers or a table name data may be announced without context or meaning clear table structure also supports keyboard users and users with cognitive disabilities it improves orientation comprehension and efficient navigation within tables what to check for data tables use semantic table markup column headers are marked as headers row headers are used where appropriate the table has a meaningful name or caption assistive technologies can announce headers and table context what to avoid using tables for layout instead of data presenting data without semantic headers omitting a table name or caption relying on visual styling alone to indicate headers related standards wcag 2 2 success criterion 1 3 1 info and relationships wcag 2 2 success criterion 2 4 6 headings and labels wcag 2 2 success criterion 4 1 2 name role value en 301 549 clause 9 1 3 1 info and relationships en 301 549 clause 9 2 4 6 headings and labels en 301 549 clause 9 4 1 2 name role value",
      "headings": [
        "What this means",
        "Why this matters",
        "What to check for",
        "What to avoid",
        "Related standards"
      ],
      "keywords": [
        "data tables",
        "table headers",
        "table captions",
        "What this means",
        "Why this matters",
        "What to check for",
        "What to avoid",
        "Related standards"
      ]
    }
  },
  {
    "slug": "/screen-reader-support/visual-audio-text",
    "title": "Is visual and auditory information presented in text format?",
    "description": "",
    "content": "## What this means\n\nInformation that is presented visually or audibly must also be available in text. Users should be able to access the same information without relying on sight or hearing.\n\nVisual information includes icons, charts, animations, and visual cues. Auditory information includes sounds, spoken instructions, alerts, and audio-only feedback.\n\n## Why this matters\n\nScreen reader users cannot access visual-only information without text alternatives. Deaf or hard of hearing users cannot perceive auditory information without text.\n\nProviding text equivalents also supports users with cognitive disabilities and users in environments where audio or visuals are limited or unavailable. Text ensures information is consistently accessible.\n\n## What to check for\n\n* Visual information has an equivalent text description.\n* Audio information is available through captions, transcripts, or text messages.\n* Instructions are not conveyed by sound or visuals alone.\n* Text alternatives convey the same meaning as the original content.\n* Assistive technologies can access the text version of the information.\n\n## What to avoid\n\n* Presenting instructions only through sound or visuals.\n* Using icons or animations without accompanying text.\n* Relying on audio cues without a text equivalent.\n* Providing text that does not convey the full meaning of the information.\n\n## Related standards\n\n* WCAG 2.2 Success Criterion 1.1.1 Non-text Content\n* WCAG 2.2 Success Criterion 1.2.1 Audio-only and Video-only (Prerecorded)\n* WCAG 2.2 Success Criterion 1.2.2 Captions (Prerecorded)\n* EN 301 549 clause 9.1.1.1 Non-text Content\n* EN 301 549 clause 9.1.2.1 Audio-only and Video-only (Prerecorded)\n* EN 301 549 clause 9.1.2.2 Captions (Prerecorded)\n",
    "_searchMeta": {
      "cleanContent": "what this means information that is presented visually or audibly must also be available in text users should be able to access the same information without relying on sight or hearing visual information includes icons charts animations and visual cues auditory information includes sounds spoken instructions alerts and audio-only feedback why this matters screen reader users cannot access visual-only information without text alternatives deaf or hard of hearing users cannot perceive auditory information without text providing text equivalents also supports users with cognitive disabilities and users in environments where audio or visuals are limited or unavailable text ensures information is consistently accessible what to check for visual information has an equivalent text description audio information is available through captions transcripts or text messages instructions are not conveyed by sound or visuals alone text alternatives convey the same meaning as the original content assistive technologies can access the text version of the information what to avoid presenting instructions only through sound or visuals using icons or animations without accompanying text relying on audio cues without a text equivalent providing text that does not convey the full meaning of the information related standards wcag 2 2 success criterion 1 1 1 non-text content wcag 2 2 success criterion 1 2 1 audio-only and video-only prerecorded wcag 2 2 success criterion 1 2 2 captions prerecorded en 301 549 clause 9 1 1 1 non-text content en 301 549 clause 9 1 2 1 audio-only and video-only prerecorded en 301 549 clause 9 1 2 2 captions prerecorded",
      "headings": [
        "What this means",
        "Why this matters",
        "What to check for",
        "What to avoid",
        "Related standards"
      ],
      "keywords": [
        "text alternatives",
        "non-text information",
        "accessibility",
        "What this means",
        "Why this matters",
        "What to check for",
        "What to avoid",
        "Related standards"
      ]
    }
  }
]
